#!/usr/bin/ruby

require 'cgi'
require 'res_util.rb'

c = CGI::new
year = c['res-year']
form = c['res-form']
prov = c['res-prov']
type = c['res-type']

h = nil

=begin

if (form == '1') # request form1 Health Manpower 1-42
  h = f15header(year,type)
  h += getForm1(year,prov,type)
  h += getForm5(year,prov,type)
  h += f15footer(year)
elsif (form == '2') # request form2 Specialty 1-79 (2550) 1-53 (2549-2547) 1-42 (2546-2545)
  h = f26header(year,type)
  h += getForm2(year,prov,type)
  h += getForm6(year,prov,type)
  h += f26footer(year)
elsif (form == '3') # request form3 High Cost Medical Equipment
  h = f37header(type)
  h += getForm3(year,prov,type)
  h += getForm7(year,prov,type)
  h += f37footer()
elsif (form == '4') # request form4 Health Activities
  h = f48header(type)
  h += getForm4(year,prov,type)
  h += getForm8(year,prov,type)
  h += f48footer()
end

print <<EOF
Content-type: text/html

<html>
<head>
<style>
.hili {
  font-size:10;
  color:red;
  background-color:yellow;
}
</style>
</head>
<body>
<pre>
#{h}
</pre>
EOF

=end

print <<EOF
Content-type: text/html

<html>
<body>
<h4>รายงานทรัพยากรสาธารณสุข 2550</h4>
<ul>
<li><a href="report50/res50-tb01.xls">ตาราง 01 จำนวนเตียง รายประเภทหน่วยงาน รายประเภทบริการ</a>
<li><a href="report50/res50-tb02.xls">ตาราง 02 จำนวนสถานพยาบาลที่มีเตียงรับผู้ป่วยไว้ค้างคืน  เตียง  ผู้ป่วยนอกใหม่(คน)   ผู้ป่วยนอกทั้งหมด(ครั้ง) ผู้ป่วยใน  วันอยู่ผู้ป่วยในและอัตราการครองเตียง แยกตามสังกัดกระทรวงปี2550</a>
<li><a href="report50/res50-tb03.xls">ตาราง 03 จำนวน เตียง  เตียงต่อประชากร แพทย์ต่อเตียง  ผู้ป่วยนอกใหม่(คน)   ผู้ป่วยนอกทั้งหมด(ครั้ง)  จำนวนผู้ป่วยใน  จำนวนวันอยู่ รพ.  และอัตราการครองเตียง  รายภาคปี2550</a>
<li><a href="report50/res50-tb04.xls">ตาราง 04 จำนวนสถานพยาบาลที่มีเตียงรับผู้ป่วยไว้ค้างคืน  เตียง  อัตราส่วนแพทย์ต่อเตียง  และเตียงต่อประชากรรายภาค  ปี 2550</a>
<li><a href="report50/res50-tb05.xls">ตาราง 05 จำนวน รพศ.  รพท.  รพช. และจำนวนเตียง  รายภาคปี 2550   กระทรวงสาธารณสุข (ภูมิภาค)</a>
<li><a href="report50/res50-tb06.xls">ตาราง 06 จำนวนสถานพยาบาลที่มีเตียงรับผู้ป่วยไว้ค้างคืน  และเตียงสังกัดกระทรวงสาธารณสุข จำแนกรายภาคปี 2550</a>
<li><a href="report50/res50-tb07.xls">ตาราง 07 จำนวนสถานพยาบาลที่มีเตียงรับผู้ป่วยไว้ค้างคืน  และเตียงนอกสังกัดกระทรวงสาธารณสุข  รายภาคปี 2550</a>
<li><a href="report50/res50-tb08.xls">ตาราง 08 จำนวนเตียง  เตียงต่อประชากร  แพทย์ต่อเตียง  ผู้ป่วยนอกใหม่(คน)  ผู้ป่วยนอกทั้งหมด(ครั้ง) จำนวนผู้ป่วยใน จำนวนวันอยู่ รพ.และอัตราการครองเตียง  รพศ. รายภาคปี 2550</a>
<li><a href="report50/res50-tb09.xls">ตาราง 09 จำนวนเตียง  เตียงต่อประชากร  แพทย์ต่อเตียง  ผู้ป่วยนอกใหม่(คน)  ผู้ป่วยนอกทั้งหมด(ครั้ง) จำนวนผู้ป่วยใน จำนวนวันอยู่ รพ.และอัตราการครองเตียง  รพท. รายภาคปี 2550</a>
<li><a href="report50/res50-tb10.xls">ตาราง 10 จำนวนเตียง  เตียงต่อประชากร  แพทย์ต่อเตียง  ผู้ป่วยนอกใหม่(คน)  ผู้ป่วยนอกทั้งหมด(ครั้ง) จำนวนผู้ป่วยใน จำนวนวันอยู่ รพ.และอัตราการครองเตียง  รพร. รพช. รายภาคปี 2550</a>
<li><a href="report50/res50-tb11.xls">ตาราง 11 จำนวนสถานีอนามัย ผู้ป่วยนอกใหม่ จำนวนครั้ง รายภาคปี 2550</a>
<li><a href="report50/res50-tb12.xls">ตาราง 12 จำนวนบุคลากรทางการแพทย์  รายภาคปี 2550</a>
<li><a href="report50/res50-tb13.xls">ตาราง 13 จำนวนและสัดส่วนแพทย์ต่อประชากร  จำแนกตามสังกัด รายภาคปี 2550</a>
<li><a href="report50/res50-tb14.xls">ตาราง 14 จำนวนและสัดส่วนทันตแพทย์ต่อประชากร  จำแนกตามสังกัด   รายภาคปี 2550</a>
<li><a href="report50/res50-tb15.xls">ตาราง 15 จำนวนและสัดส่วนเภสัชกรต่อประชากร  จำแนกตามสังกัด   รายภาคปี 2550</a>
<li><a href="report50/res50-tb16.xls">ตาราง 16 จำนวนและสัดส่วนพยาบาลวิชาชีพต่อประชากร  จำแนกตามสังกัด   รายภาคปี 2550</a>
<li><a href="report50/res50-tb17.xls">ตาราง 17 จำนวนและสัดส่วนพยาบาลเทคนิคต่อประชากร  จำแนกตามสังกัด   รายภาคปี 2550</a>
<li><a href="report50/res50-tb18.xls">ตาราง 18 จำนวนบุคลากรทางการแพทย์  รพศ.  รายภาคปี 2550</a>
<li><a href="report50/res50-tb19.xls">ตาราง 19 จำนวนบุคลากรทางการแพทย์  รพท.  รายภาคปี 2550</a>
<li><a href="report50/res50-tb20.xls">ตาราง 20 จำนวนบุคลากรทางการแพทย์  รพช. รพร.   รายภาคปี 2550</a>
<li><a href="report50/res50-tb21.xls">ตาราง 21 จำนวนบุคลากรทางการแพทย์  สถานีอนามัย   รายภาคปี 2550</a>
<li><a href="report50/res50-tb22.xls">ตาราง 22 จำนวนแพทย์เฉพาะทางสาขาต่างๆ   รายภาคปี 2550</a>
<li><a href="report50/res50-tb23.xls">ตาราง 23 จำนวนครุภัณฑ์ทางการแพทย์ที่สำคัญ    รายภาคปี 2550</a>
<li><a href="report50/res50-tb24.xls">ตาราง 24 จำนวนสถานพยาบาลที่มีเตียงรับผู้ป่วยไว้ค้างคืน  และจำนวนเตียง   จำแนกตามสังกัด   รายจังหวัดปี 2550</a>
<li><a href="report50/res50-tb25.xls">ตาราง 25 จำนวน  รพศ.  รพท.  รพช. และเตียง   รายจังหวัดปี 2550</a>
<li><a href="report50/res50-tb26.xls">ตาราง 26 จำนวนเตียง  เตียงต่อประชากร  แพทย์ต่อเตียง  จำนวนผู้ป่วยนอกใหม่(คน)   จำนวนผู้ป่วยนอกทั้งหมด(ครั้ง) ผู้ป่วยใน  วันอยู่ผู้ป่วยใน  และอัตราการครองเตียง  รายจังหวัด  รายเขตและรายภาคปี 2550</a>
<li><a href="report50/res50-tb27.xls">ตาราง 27 จำนวนเตียง  เตียงต่อประชากร  แพทย์ต่อเตียง  จำนวนผู้ป่วยนอกใหม่(คน)   จำนวนผู้ป่วยนอกทั้งหมด(ครั้ง) จำนวนผู้ป่วยใน  วันอยู่ผู้ป่วยในและอัตราการครองเตียง  รายจังหวัดของ  รพศ.  ปี 2550</a>
<li><a href="report50/res50-tb28.xls">ตาราง 28 จำนวนเตียง  เตียงต่อประชากร  แพทย์ต่อเตียง  จำนวนผู้ป่วยนอกใหม่(คน)  จำนวนผู้ป่วยนอกทั้งหมด(ครั้ง) จำนวนผู้ป่วยใน  วันอยู่ผู้ป่วยใน  และอัตราการครองเตียง   รายจังหวัด  รพท.ปี 2550</a>
<li><a href="report50/res50-tb29.xls">ตาราง 29 จำนวนเตียง  เตียงต่อประชากร  แพทย์ต่อเตียง  จำนวนผู้ป่วยนอกใหม่(คน)  จำนวนผู้ป่วยนอกทั้งหมด(ครั้ง) จำนวนผู้ป่วยใน  วันอยู่ผู้ป่วยในและอัตราการครองเตียง  รายจังหวัด  รพช. รพร.  ปี 2550</a>
<li><a href="report50/res50-tb30.xls">ตาราง 30 จำนวนเตียงผู้ป่วยหนัก (ICU)   จำแนกตามสังกัด  รายจังหวัดปี 2550</a>
<li><a href="report50/res50-tb31.xls">ตาราง 31 จำนวนสถานีอนามัย   ผู้ป่วยนอกใหม่   จำนวนครั้ง   เฉลี่ยวันละ  รายเขต  รายจังหวัดปี 2550</a>
<li><a href="report50/res50-tb32.xls">ตาราง 32 จำนวนและสัดส่วนแพทย์ต่อประชากร  จำแนกตามสังกัด  รายจังหวัด  รายเขต  รายภาคปี 2550</a>
<li><a href="report50/res50-tb33.xls">ตาราง 33 จำนวนและสัดส่วนทันตแพทย์ต่อประชากร   จำแนกตามสังกัด  รายจังหวัด  รายเขต  รายภาคปี 2550</a>
<li><a href="report50/res50-tb34.xls">ตาราง 34 จำนวนและสัดส่วนเภสัชกรแพทย์ต่อประชากร   จำแนกตามสังกัด  รายจังหวัด  รายเขต  รายภาคปี 2550</a>
<li><a href="report50/res50-tb35.xls">ตาราง 35 จำนวนและสัดส่วนพยาบาลวิชาชีพต่อประชากร   จำแนกตามสังกัด  รายจังหวัด  รายเขต  รายภาคปี 2550</a>
<li><a href="report50/res50-tb36.xls">ตาราง 36 จำนวนและสัดส่วนพยาบาลเทคนิคต่อประชากร   จำแนกตามสังกัด  รายจังหวัด  รายเขต  รายภาคปี 2550</a>
<li><a href="report50/res50-tb37.xls">ตาราง 37 จำนวนบุคลากรทางการแพทย์  รพศ.  รายจังหวัดปี 2550</a>
<li><a href="report50/res50-tb38.xls">ตาราง 38 จำนวนบุคลากรทางการแพทย์  รพท.  รายจังหวัดปี 2550</a>
<li><a href="report50/res50-tb39.xls">ตาราง 39 จำนวนบุคลากรทางการแพทย์  รพช.  รพร.  รายจังหวัดปี 2550</a>
<li><a href="report50/res50-tb40.xls">ตาราง 40 จำนวนบุคลากรทางการแพทย์ของสถานีอนามัย  รายจังหวัดปี 2550</a>
<li><a href="report50/res50-tb41.xls">ตาราง 41 จำนวนแพทย์เฉพาะทางสาขาต่างๆ   รายจังหวัดปี 2550</a>
<li><a href="report50/res50-tb41-1.xls">ตาราง 41.1 จำนวนแพทย์เฉพาะทางสาขาต่างๆ   รายจังหวัดปี 2550</a>
<li><a href="report50/res50-tb41-2.xls">ตาราง 41.2 จำนวนแพทย์เฉพาะทางสาขาต่างๆ   รายจังหวัดปี 2550</a>
<li><a href="report50/res50-tb41-3.xls">ตาราง 41.3 จำนวนแพทย์เฉพาะทางสาขาต่างๆ   รายจังหวัดปี 2550</a>
<li><a href="report50/res50-tb41-4.xls">ตาราง 41.4 จำนวนแพทย์เฉพาะทางสาขาต่างๆ   รายจังหวัดปี 2550</a>
<li><a href="report50/res50-tb41-5.xls">ตาราง 41.5 จำนวนแพทย์เฉพาะทางสาขาต่างๆ   รายจังหวัดปี 2550</a>
<li><a href="report50/res50-tb41-6.xls">ตาราง 41.6 จำนวนแพทย์เฉพาะทางสาขาต่างๆ   รายจังหวัดปี 2550</a>
<li><a href="report50/res50-tb42.xls">ตาราง 42 จำนวนบุคลากรสาธารณสุขที่ปฏิบัติงานไม่เต็มเวลา (part-time)ในโรงพยาบาลเอกชน จำแนกรายจังหวัดปี 2550</a>
<li><a href="report50/res50-tb43.xls">ตาราง 43 จำนวนครุภัณฑ์การแพทย์ที่สำคัญ   รายจังหวัด รายเขต  รายภาคปี 2550</a>
</ul>
</body>
</html>
EOF
