#!/usr/bin/ruby

require 'cgi'
require '/res53/res_util.rb'

c = CGI::new
year = c['res-year']
form = c['res-form']
prov = c['res-prov']
type = c['res-type']
amp = c['res-amp']

h = nil

if (form == '1') # request form1 Health Manpower 1-42 (2551) or 1-40 (2552)
  h1 = f15header(year,type,'1')
  f1 = getForm1(year,prov,amp,type)
  h = "#{h1}#{f1}"

  h5 = f15header(year,type,'5')
  f5= getForm5(year,prov,amp,type)
  if (f5.to_s.length > 10)
    h = "#{h}#{h5}"
    h = "#{h}#{f5}"
  end
  h += f15footer(year)
elsif (form == '2') # request form2 Specialty 1-79 (2550) 1-53 (2549-2547) 1-42 (2546-2545)
  h2 = f26header(year,type,'2')
  f2= getForm2(year,prov,amp,type)
  h = "#{h2}#{f2}"

  h6 = f26header(year,type,'6')
  f6= getForm6(year,prov,amp,type)
  if (f6.to_s.length > 10)
    h = "#{h}#{h6}"
    h = "#{h}#{f6}"
  end

  h += f26footer(year)
elsif (form == '3') # request form3 High Cost Medical Equipment
  h = f37header(type)
  f3= getForm3(year,prov,amp,type)
  h = "#{h}#{f3}"
  f7= getForm7(year,prov,amp,type)
  h = "#{h}#{f7}"
  h += f37footer()
elsif (form == '4') # request form4 Health Activities
  h = f48header(type)
  f4= getForm4(year,prov,amp,type)
  h = "#{h}#{f4}"
  f8= getForm8(year,prov,amp,type)
  h = "#{h}#{f8}"
  h += f48footer()
end

print <<EOF
Content-type: text/html

<html>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
<head>
<style>
a {
  text-decoration: none;
}
.hili {
  font-size:10;
  color:red;
  background-color:yellow;
}
</style>
<script type="text/javascript">
var p = ["","กุมารเวชศาสตร์โรคหัวใจ","กุมารเวชศาสตร์โรคระบบการหายใจ",
"กุมารเวชศาสตร์โรคต่อมไร้ท่อและเมตาบอลิสม","กุมารเวชศาสตร์พัฒนาการและพฤติกรรม",
"กุมารเวชศาสตร์โรคไต","กุมารเวชศาสตร์โรคติดเชื้อ",
"กุมารเวชศาสตร์โรคทางเดินอาหารและโรคตับ","กุมารเวชศาสตร์ประสาทวิทยา",
"กุมารเวชศาสตร์โรคภูมิแพ้และภูมิคุ้มกัน","กุมารเวชศาสตร์",
"กุมารเวชศาสตร์โรคเลือด","กุมารเวชศาสตร์ทารกแรกเกิดและปริกำเนิด",
"จักษุวิทยา","จิตเวชศาสตร์เด็กและวัยรุ่น",
"จิตเวชศาสตร์","พยาธิวิทยาคลินิก",
"นิติเวชศาสตร์","พยาธิวิทยาทั่วไป",
"พยาธิวิทยากายวิภาค","รังสีวิทยาทั่วไป",
"รังสีวิทยาวินิจฉัย","รังสีรักษาและมะเร็งวิทยา",
"เวชศาสตร์นิวเคลียร์","รังสีรักษาและเวชศาสตร์นิวเคลียร์",
"ภาพวินิจฉัยระบบประสาท(1001)","รังสีร่วมรักษาระบบประสาท(1002)",
"รังสีร่วมรักษาของลำตัว(1003)","ภาพวินิจฉัยชั้นสูง(1004)",
"ภาพวินิจฉัยระบบประสาท(1101)","รังสีร่วมรักษาระบบประสาท(1102)",
"รังสีร่วมรักษาของลำตัว(1103)","ภาพวินิจฉัยชั้นสูง(1104)",
"วิสัญญีวิทยา","วิสัญญีวิทยาเพื่อการผ่าตัดหัวใจหลอดเลือดใหญ่และทรวงอก",
"วิสัญญีวิทยาสำหรับผู้ป่วยโรคทางระบบประสาท","เวชปฏิบัติทั่วไป",
"เวชศาสตร์ครอบครัว","เวชศาสตร์ป้องกัน",
"แขนงสาธารณสุขศาสตร์","แขนงระบาดวิทยา",
"แขนงเวชศาสตร์ป้องกันคลินิก","แขนงเวชศาสตร์การบิน",
"แขนงอาชีวเวชศาสตร์","แขนงสุขภาพจิตชุมชน",
"เวชศาสตร์ฟื้นฟู","ศัลยศาสตร์",
"ประสาทศัลยศาสตร์","ศัลยศาสตร์ตกแต่ง",
"ศัลยศาสตร์ทรวงอก","ศัลยศาสตร์ยูโรวิทยา",
"กุมารศัลยศาสตร์","ศัลยศาสตร์ลำไส้ใหญ่และทวารหนัก",
"ศัลยศาสตร์หลอดเลือด","ศัลยศาสตร์อุบัติเหตุ",
"ศัลยศาสตร์มะเร็งวิทยา","ศัลยศาสตร์ออร์โธปิดิกส์",
"สูติศาสตร์-นรีเวชวิทยา","เวชศาสตร์มารดาและทารกในครรภ์",
"มะเร็งนรีเวชวิทยา","เวชศาสตร์การเจริญพันธุ์",
"โสต ศอ นาสิกวิทยา","ศัลยศาสตร์ตกแต่งและเสริมสร้างใบหน้า",
"อายุรศาสตร์","อายุรศาสตร์โรคเลือด",
"อายุรศาสตร์มะเร็งวิทยา","ประสาทวิทยา",
"ตจวิทยา","เวชศาสตร์ฉุกเฉิน",
"โลหิตวิทยา","อายุรศาสตร์โรคทรวงอก",
"อายุรศาสตร์โรคติดเชื้อ","อายุรศาสตร์โรคข้อและรูมาติสซั่ม",
"อายุรศาสตร์โรคต่อมไร้ท่อและเมตะบอลิสม","อายุรศาสตร์โรคภูมิแพ้และอิมมูโนวิทยาคลินิก",
"อายุรศาสตร์โรคระบบทางเดินอาหาร","อายุรศาสตร์โรคไต",
"อายุรศาสตร์โรคหัวใจ","อายุรศาสตร์โรคระบบการหายใจและภาวะวิกฤต",
"เวชบำบัดวิกฤต",
"รวม"];

function getProf(code,type,form)
{
  var prof = '';
  if (form == 'm2')
  {
    if (type == '1')
      prof = p[code] + " ขรก/พนักงานของรัฐชาย";
    else
      prof = p[code] + " ลูกจ้างชาย";
  }  
  if (form == 'm6')
  {
    if (type == '1')
      prof = p[code] + " Fulltime ชาย";
    else
      prof = p[code] + " Parttime ชาย";
  }  
  if (form == 'f2')
  {
    if (type == '1')
      prof = p[code] + " ขรก/พนักงานของรัฐหญิง";
    else
      prof = p[code] + " ลูกจ้างหญิง";
  }  
  if (form == 'f6')
  {
    if (type == '1')
      prof = p[code] + " Fulltime หญิง";
    else
      prof = p[code] + " Parttime หญิง";
  }
  return prof;  
}
</script>
</head>

<body bgcolor='#AAEDFE'>
<script type="text/javascript" src="js/wz_tooltip.js"></script>
<script type="text/javascript">
if (#{year} >= '52')
{
  var s011m1 = "นายแพทย์ ขรก/พนักงานของรัฐชาย";
  var s011m5 = "นายแพทย์ Fulltime ชาย";
  var s011f1 = "นายแพทย์ ขรก/พนักงานของรัฐหญิง";
  var s011f5 = "นายแพทย์ Fulltime หญิง";
  var s012m1 = "นายแพทย์ ลูกจ้างชาย";
  var s012m5 = "นายแพทย์ Parttime ชาย";
  var s012f1 = "นายแพทย์ ลูกจ้างหญิง";
  var s012f5 = "นายแพทย์ Parttime หญิง";

  var s021m1 = "ทันตแพทย์ ขรก/พนักงานของรัฐชาย";
  var s021m5 = "ทันตแพทย์ Fulltime ชาย";
  var s021f1 = "ทันตแพทย์ ขรก/พนักงานของรัฐหญิง";
  var s021f5 = "ทันตแพทย์ Fulltime หญิง";
  var s022m1 = "ทันตแพทย์ ลูกจ้างชาย";
  var s022m5 = "ทันตแพทย์ Parttime ชาย";
  var s022f1 = "ทันตแพทย์ ลูกจ้างหญิง";
  var s022f5 = "ทันตแพทย์ Parttime หญิง";

  var s031m1 = "เจ้าพนักงานทันตสาธารณสุข ขรก/พนักงานของรัฐชาย";
  var s031m5 = "เจ้าพนักงานทันตสาธารณสุข Fulltime ชาย";
  var s031f1 = "เจ้าพนักงานทันตสาธารณสุข ขรก/พนักงานของรัฐหญิง";
  var s031f5 = "เจ้าพนักงานทันตสาธารณสุข Fulltime หญิง";
  var s032m1 = "เจ้าพนักงานทันตสาธารณสุข ลูกจ้างชาย";
  var s032m5 = "เจ้าพนักงานทันตสาธารณสุข Parttime ชาย";
  var s032f1 = "เจ้าพนักงานทันตสาธารณสุข ลูกจ้างหญิง";
  var s032f5 = "เจ้าพนักงานทันตสาธารณสุข Parttime หญิง";

  var s041m1 = "นายสัตวแพทย์ ขรก/พนักงานของรัฐชาย";
  var s041m5 = "นายสัตวแพทย์ Fulltime ชาย";
  var s041f1 = "นายสัตวแพทย์ ขรก/พนักงานของรัฐหญิง";
  var s041f5 = "นายสัตวแพทย์ Fulltime หญิง";
  var s042m1 = "นายสัตวแพทย์ ลูกจ้างชาย";
  var s042m5 = "นายสัตวแพทย์ Parttime ชาย";
  var s042f1 = "นายสัตวแพทย์ ลูกจ้างหญิง";
  var s042f5 = "นายสัตวแพทย์ Parttime หญิง";

  var s051m1 = "สัตวแพทย์ ขรก/พนักงานของรัฐชาย";
  var s051m5 = "สัตวแพทย์ Fulltime ชาย";
  var s051f1 = "สัตวแพทย์ ขรก/พนักงานของรัฐหญิง";
  var s051f5 = "สัตวแพทย์ Fulltime หญิง";
  var s052m1 = "สัตวแพทย์ ลูกจ้างชาย";
  var s052m5 = "สัตวแพทย์ Parttime ชาย";
  var s052f1 = "สัตวแพทย์ ลูกจ้างหญิง";
  var s052f5 = "สัตวแพทย์ Parttime หญิง";

  var s061m1 = "เภสัชกร ขรก/พนักงานของรัฐชาย";
  var s061m5 = "เภสัชกร Fulltime ชาย";
  var s061f1 = "เภสัชกร ขรก/พนักงานของรัฐหญิง";
  var s061f5 = "เภสัชกร Fulltime หญิง";
  var s062m1 = "เภสัชกร ลูกจ้างชาย";
  var s062m5 = "เภสัชกร Parttime ชาย";
  var s062f1 = "เภสัชกร ลูกจ้างหญิง";
  var s062f5 = "เภสัชกร Parttime หญิง";

  var s071m1 = "เจ้าพนักงานเภสัชกรรม ขรก/พนักงานของรัฐชาย";
  var s071m5 = "เจ้าพนักงานเภสัชกรรม Fulltime ชาย";
  var s071f1 = "เจ้าพนักงานเภสัชกรรม ขรก/พนักงานของรัฐหญิง";
  var s071f5 = "เจ้าพนักงานเภสัชกรรม Fulltime หญิง";
  var s072m1 = "เจ้าพนักงานเภสัชกรรม ลูกจ้างชาย";
  var s072m5 = "เจ้าพนักงานเภสัชกรรม Parttime ชาย";
  var s072f1 = "เจ้าพนักงานเภสัชกรรม ลูกจ้างหญิง";
  var s072f5 = "เจ้าพนักงานเภสัชกรรม Parttime หญิง";

  var s081m1 = "พยาบาลวิชาชีพ ขรก/พนักงานของรัฐชาย";
  var s081m5 = "พยาบาลวิชาชีพ Fulltime ชาย";
  var s081f1 = "พยาบาลวิชาชีพ ขรก/พนักงานของรัฐหญิง";
  var s081f5 = "พยาบาลวิชาชีพ Fulltime หญิง";
  var s082m1 = "พยาบาลวิชาชีพ ลูกจ้างชาย";
  var s082m5 = "พยาบาลวิชาชีพ Parttime ชาย";
  var s082f1 = "พยาบาลวิชาชีพ ลูกจ้างหญิง";
  var s082f5 = "พยาบาลวิชาชีพ Parttime หญิง";

  var s091m1 = "พยาบาลเทคนิค ขรก/พนักงานของรัฐชาย";
  var s091m5 = "พยาบาลเทคนิค Fulltime ชาย";
  var s091f1 = "พยาบาลเทคนิค ขรก/พนักงานของรัฐหญิง";
  var s091f5 = "พยาบาลเทคนิค Fulltime หญิง";
  var s092m1 = "พยาบาลเทคนิค ลูกจ้างชาย";
  var s092m5 = "พยาบาลเทคนิค Parttime ชาย";
  var s092f1 = "พยาบาลเทคนิค ลูกจ้างหญิง";
  var s092f5 = "พยาบาลเทคนิค Parttime หญิง";

  var s101m1 = "วิสัญญีพยาบาล ขรก/พนักงานของรัฐชาย";
  var s101m5 = "วิสัญญีพยาบาล Fulltime ชาย";
  var s101f1 = "วิสัญญีพยาบาล ขรก/พนักงานของรัฐหญิง";
  var s101f5 = "วิสัญญีพยาบาล Fulltime หญิง";
  var s102m1 = "วิสัญญีพยาบาล ลูกจ้างชาย";
  var s102m5 = "วิสัญญีพยาบาล Parttime ชาย";
  var s102f1 = "วิสัญญีพยาบาล ลูกจ้างหญิง";
  var s102f5 = "วิสัญญีพยาบาล Parttime หญิง";

  var s111m1 = "เจ้าพนักงานผดุงครรภ์สาธารณสุข ขรก/พนักงานของรัฐชาย";
  var s111m5 = "เจ้าพนักงานผดุงครรภ์สาธารณสุข Fulltime ชาย";
  var s111f1 = "เจ้าพนักงานผดุงครรภ์สาธารณสุข ขรก/พนักงานของรัฐหญิง";
  var s111f5 = "เจ้าพนักงานผดุงครรภ์สาธารณสุข Fulltime หญิง";
  var s112m1 = "เจ้าพนักงานผดุงครรภ์สาธารณสุข ลูกจ้างชาย";
  var s112m5 = "เจ้าพนักงานผดุงครรภ์สาธารณสุข Parttime ชาย";
  var s112f1 = "เจ้าพนักงานผดุงครรภ์สาธารณสุข ลูกจ้างหญิง";
  var s112f5 = "เจ้าพนักงานผดุงครรภ์สาธารณสุข Parttime หญิง";

  var s121m1 = "นักวิชาการสาธารณสุข ขรก/พนักงานของรัฐชาย";
  var s121m5 = "นักวิชาการสาธารณสุข Fulltime ชาย";
  var s121f1 = "นักวิชาการสาธารณสุข ขรก/พนักงานของรัฐหญิง";
  var s121f5 = "นักวิชาการสาธารณสุข Fulltime หญิง";
  var s122m1 = "นักวิชาการสาธารณสุข ลูกจ้างชาย";
  var s122m5 = "นักวิชาการสาธารณสุข Parttime ชาย";
  var s122f1 = "นักวิชาการสาธารณสุข ลูกจ้างหญิง";
  var s122f5 = "นักวิชาการสาธารณสุข Parttime หญิง";

  var s131m1 = "นักวิชาการสุขาภิบาล ขรก/พนักงานของรัฐชาย";
  var s131m5 = "นักวิชาการสุขาภิบาล Fulltime ชาย";
  var s131f1 = "นักวิชาการสุขาภิบาล ขรก/พนักงานของรัฐหญิง";
  var s131f5 = "นักวิชาการสุขาภิบาล Fulltime หญิง";
  var s132m1 = "นักวิชาการสุขาภิบาล ลูกจ้างชาย";
  var s132m5 = "นักวิชาการสุขาภิบาล Parttime ชาย";
  var s132f1 = "นักวิชาการสุขาภิบาล ลูกจ้างหญิง";
  var s132f5 = "นักวิชาการสุขาภิบาล Parttime หญิง";

  var s141m1 = "นักกายภาพบำบัด ขรก/พนักงานของรัฐชาย";
  var s141m5 = "นักกายภาพบำบัด Fulltime ชาย";
  var s141f1 = "นักกายภาพบำบัด ขรก/พนักงานของรัฐหญิง";
  var s141f5 = "นักกายภาพบำบัด Fulltime หญิง";
  var s142m1 = "นักกายภาพบำบัด ลูกจ้างชาย";
  var s142m5 = "นักกายภาพบำบัด Parttime ชาย";
  var s142f1 = "นักกายภาพบำบัด ลูกจ้างหญิง";
  var s142f5 = "นักกายภาพบำบัด Parttime หญิง";

  var s151m1 = "นักอาชีวบำบัด ขรก/พนักงานของรัฐชาย";
  var s151m5 = "นักอาชีวบำบัด Fulltime ชาย";
  var s151f1 = "นักอาชีวบำบัด ขรก/พนักงานของรัฐหญิง";
  var s151f5 = "นักอาชีวบำบัด Fulltime หญิง";
  var s152m1 = "นักอาชีวบำบัด ลูกจ้างชาย";
  var s152m5 = "นักอาชีวบำบัด Parttime ชาย";
  var s152f1 = "นักอาชีวบำบัด ลูกจ้างหญิง";
  var s152f5 = "นักอาชีวบำบัด Parttime หญิง";

  var s161m1 = "เจ้าพนักงานอาชีวบำบัด ขรก/พนักงานของรัฐชาย";
  var s161m5 = "เจ้าพนักงานอาชีวบำบัด Fulltime ชาย";
  var s161f1 = "เจ้าพนักงานอาชีวบำบัด ขรก/พนักงานของรัฐหญิง";
  var s161f5 = "เจ้าพนักงานอาชีวบำบัด Fulltime หญิง";
  var s162m1 = "เจ้าพนักงานอาชีวบำบัด ลูกจ้างชาย";
  var s162m5 = "เจ้าพนักงานอาชีวบำบัด Parttime ชาย";
  var s162f1 = "เจ้าพนักงานอาชีวบำบัด ลูกจ้างหญิง";
  var s162f5 = "เจ้าพนักงานอาชีวบำบัด Parttime หญิง";

  var s171m1 = "เจ้าพนักงานเวชกรรมฟื้นฟู ขรก/พนักงานของรัฐชาย";
  var s171m5 = "เจ้าพนักงานเวชกรรมฟื้นฟู Fulltime ชาย";
  var s171f1 = "เจ้าพนักงานเวชกรรมฟื้นฟู ขรก/พนักงานของรัฐหญิง";
  var s171f5 = "เจ้าพนักงานเวชกรรมฟื้นฟู Fulltime หญิง";
  var s172m1 = "เจ้าพนักงานเวชกรรมฟื้นฟู ลูกจ้างชาย";
  var s172m5 = "เจ้าพนักงานเวชกรรมฟื้นฟู Parttime ชาย";
  var s172f1 = "เจ้าพนักงานเวชกรรมฟื้นฟู ลูกจ้างหญิง";
  var s172f5 = "เจ้าพนักงานเวชกรรมฟื้นฟู Parttime หญิง";

  var s181m1 = "นักเทคนิคการแพทย์ ขรก/พนักงานของรัฐชาย";
  var s181m5 = "นักเทคนิคการแพทย์ Fulltime ชาย";
  var s181f1 = "นักเทคนิคการแพทย์ ขรก/พนักงานของรัฐหญิง";
  var s181f5 = "นักเทคนิคการแพทย์ Fulltime หญิง";
  var s182m1 = "นักเทคนิคการแพทย์ ลูกจ้างชาย";
  var s182m5 = "นักเทคนิคการแพทย์ Parttime ชาย";
  var s182f1 = "นักเทคนิคการแพทย์ ลูกจ้างหญิง";
  var s182f5 = "นักเทคนิคการแพทย์ Parttime หญิง";

  var s191m1 = "นักวิทยาศาสตร์การแพทย์ ขรก/พนักงานของรัฐชาย";
  var s191m5 = "นักวิทยาศาสตร์การแพทย์ Fulltime ชาย";
  var s191f1 = "นักวิทยาศาสตร์การแพทย์ ขรก/พนักงานของรัฐหญิง";
  var s191f5 = "นักวิทยาศาสตร์การแพทย์ Fulltime หญิง";
  var s192m1 = "นักวิทยาศาสตร์การแพทย์ ลูกจ้างชาย";
  var s192m5 = "นักวิทยาศาสตร์การแพทย์ Parttime ชาย";
  var s192f1 = "นักวิทยาศาสตร์การแพทย์ ลูกจ้างหญิง";
  var s192f5 = "นักวิทยาศาสตร์การแพทย์ Parttime หญิง";

  var s201m1 = "เจ้าพนักงานวิทยาศาสตร์การแพทย์ ขรก/พนักงานของรัฐชาย";
  var s201m5 = "เจ้าพนักงานวิทยาศาสตร์การแพทย์ Fulltime ชาย";
  var s201f1 = "เจ้าพนักงานวิทยาศาสตร์การแพทย์ ขรก/พนักงานของรัฐหญิง";
  var s201f5 = "เจ้าพนักงานวิทยาศาสตร์การแพทย์ Fulltime หญิง";
  var s202m1 = "เจ้าพนักงานวิทยาศาสตร์การแพทย์ ลูกจ้างชาย";
  var s202m5 = "เจ้าพนักงานวิทยาศาสตร์การแพทย์ Parttime ชาย";
  var s202f1 = "เจ้าพนักงานวิทยาศาสตร์การแพทย์ ลูกจ้างหญิง";
  var s202f5 = "เจ้าพนักงานวิทยาศาสตร์การแพทย์ Parttime หญิง";

  var s211m1 = "นักรังสี (นักฟิสิกส์รังสี) ขรก/พนักงานของรัฐชาย";
  var s211m5 = "นักรังสี (นักฟิสิกส์รังสี) Fulltime ชาย";
  var s211f1 = "นักรังสี (นักฟิสิกส์รังสี) ขรก/พนักงานของรัฐหญิง";
  var s211f5 = "นักรังสี (นักฟิสิกส์รังสี) Fulltime หญิง";
  var s212m1 = "นักรังสี (นักฟิสิกส์รังสี) ลูกจ้างชาย";
  var s212m5 = "นักรังสี (นักฟิสิกส์รังสี) Parttime ชาย";
  var s212f1 = "นักรังสี (นักฟิสิกส์รังสี) ลูกจ้างหญิง";
  var s212f5 = "นักรังสี (นักฟิสิกส์รังสี) Parttime หญิง";

  var s221m1 = "นักรังสีการแพทย์ ขรก/พนักงานของรัฐชาย";
  var s221m5 = "นักรังสีการแพทย์ Fulltime ชาย";
  var s221f1 = "นักรังสีการแพทย์ ขรก/พนักงานของรัฐหญิง";
  var s221f5 = "นักรังสีการแพทย์ Fulltime หญิง";
  var s222m1 = "นักรังสีการแพทย์ ลูกจ้างชาย";
  var s222m5 = "นักรังสีการแพทย์ Parttime ชาย";
  var s222f1 = "นักรังสีการแพทย์ ลูกจ้างหญิง";
  var s222f5 = "นักรังสีการแพทย์ Parttime หญิง";

  var s231m1 = "เจ้าพนักงานรังสีการแพทย์ ขรก/พนักงานของรัฐชาย";
  var s231m5 = "เจ้าพนักงานรังสีการแพทย์ Fulltime ชาย";
  var s231f1 = "เจ้าพนักงานรังสีการแพทย์ ขรก/พนักงานของรัฐหญิง";
  var s231f5 = "เจ้าพนักงานรังสีการแพทย์ Fulltime หญิง";
  var s232m1 = "เจ้าพนักงานรังสีการแพทย์ ลูกจ้างชาย";
  var s232m5 = "เจ้าพนักงานรังสีการแพทย์ Parttime ชาย";
  var s232f1 = "เจ้าพนักงานรังสีการแพทย์ ลูกจ้างหญิง";
  var s232f5 = "เจ้าพนักงานรังสีการแพทย์ Parttime หญิง";

  var s241m1 = "นักโภชนาการ ขรก/พนักงานของรัฐชาย";
  var s241m5 = "นักโภชนาการ Fulltime ชาย";
  var s241f1 = "นักโภชนาการ ขรก/พนักงานของรัฐหญิง";
  var s241f5 = "นักโภชนาการ Fulltime หญิง";
  var s242m1 = "นักโภชนาการ ลูกจ้างชาย";
  var s242m5 = "นักโภชนาการ Parttime ชาย";
  var s242f1 = "นักโภชนาการ ลูกจ้างหญิง";
  var s242f5 = "นักโภชนาการ Parttime หญิง";

  var s251m1 = "โภชนากร ขรก/พนักงานของรัฐชาย";
  var s251m5 = "โภชนากร Fulltime ชาย";
  var s251f1 = "โภชนากร ขรก/พนักงานของรัฐหญิง";
  var s251f5 = "โภชนากร Fulltime หญิง";
  var s252m1 = "โภชนากร ลูกจ้างชาย";
  var s252m5 = "โภชนากร Parttime ชาย";
  var s252f1 = "โภชนากร ลูกจ้างหญิง";
  var s252f1 = "โภชนากร Parttime หญิง";

  var s261m1 = "นักจิตวิทยา ขรก/พนักงานของรัฐชาย";
  var s261m5 = "นักจิตวิทยา Fulltime ชาย";
  var s261f1 = "นักจิตวิทยา ขรก/พนักงานของรัฐหญิง";
  var s261f5 = "นักจิตวิทยา Fulltime หญิง";
  var s262m1 = "นักจิตวิทยา ลูกจ้างชาย";
  var s262m5 = "นักจิตวิทยา Parttime ชาย";
  var s262f1 = "นักจิตวิทยา ลูกจ้างหญิง";
  var s262f5 = "นักจิตวิทยา Parttime หญิง";

  var s271m1 = "นักสังคมสงเคราะห์ ขรก/พนักงานของรัฐชาย";
  var s271m5 = "นักสังคมสงเคราะห์ Fulltime ชาย";
  var s271f1 = "นักสังคมสงเคราะห์ ขรก/พนักงานของรัฐหญิง";
  var s271f5 = "นักสังคมสงเคราะห์ Fulltime หญิง";
  var s272m1 = "นักสังคมสงเคราะห์ ลูกจ้างชาย";
  var s272m5 = "นักสังคมสงเคราะห์ Parttime ชาย";
  var s272f1 = "นักสังคมสงเคราะห์ ลูกจ้างหญิง";
  var s272f5 = "นักสังคมสงเคราะห์ Parttime หญิง";

  var s281m1 = "นักวิชาการสถิติ ขรก/พนักงานของรัฐชาย";
  var s281m5 = "นักวิชาการสถิติ Fulltime ชาย";
  var s281f1 = "นักวิชาการสถิติ ขรก/พนักงานของรัฐหญิง";
  var s281f5 = "นักวิชาการสถิติ Fulltime หญิง";
  var s282m1 = "นักวิชาการสถิติ ลูกจ้างชาย";
  var s282m5 = "นักวิชาการสถิติ Parttime ชาย";
  var s282f1 = "นักวิชาการสถิติ ลูกจ้างหญิง";
  var s282f5 = "นักวิชาการสถิติ Parttime หญิง";

  var s291m1 = "เจ้าพนักงานเวชสถิติ ขรก/พนักงานของรัฐชาย";
  var s291m5 = "เจ้าพนักงานเวชสถิติ Fulltime ชาย";
  var s291f1 = "เจ้าพนักงานเวชสถิติ ขรก/พนักงานของรัฐหญิง";
  var s291f5 = "เจ้าพนักงานเวชสถิติ Fulltime หญิง";
  var s292m1 = "เจ้าพนักงานเวชสถิติ ลูกจ้างชาย";
  var s292m5 = "เจ้าพนักงานเวชสถิติ Parttime ชาย";
  var s292f1 = "เจ้าพนักงานเวชสถิติ ลูกจ้างหญิง";
  var s292f5 = "เจ้าพนักงานเวชสถิติ Parttime หญิง";

  var s301m1 = "เจ้าพนักงานสถิติ ขรก/พนักงานของรัฐชาย";
  var s301m5 = "เจ้าพนักงานสถิติ Fulltime ชาย";
  var s301f1 = "เจ้าพนักงานสถิติ ขรก/พนักงานของรัฐหญิง";
  var s301f5 = "เจ้าพนักงานสถิติ Fulltime หญิง";
  var s302m1 = "เจ้าพนักงานสถิติ ลูกจ้างชาย";
  var s302m5 = "เจ้าพนักงานสถิติ Parttime ชาย";
  var s302f1 = "เจ้าพนักงานสถิติ ลูกจ้างหญิง";
  var s302f5 = "เจ้าพนักงานสถิติ Parttime หญิง";

  var s311m1 = "เจ้าพนักงานสาธารณสุข ขรก/พนักงานของรัฐชาย";
  var s311m5 = "เจ้าพนักงานสาธารณสุข Fulltime ชาย";
  var s312f1 = "เจ้าพนักงานสาธารณสุข ขรก/พนักงานของรัฐหญิง";
  var s312f5 = "เจ้าพนักงานสาธารณสุข Fulltime หญิง";
  var s311m1 = "เจ้าพนักงานสาธารณสุข ลูกจ้างชาย";
  var s312m5 = "เจ้าพนักงานสาธารณสุข Parttime ชาย";
  var s312f1 = "เจ้าพนักงานสาธารณสุข ลูกจ้างหญิง";
  var s312f5 = "เจ้าพนักงานสาธารณสุข Parttime หญิง";

  var s321m1 = "นักวิเคราะห์นโยบายและแผน ขรก/พนักงานของรัฐชาย";
  var s321m5 = "นักวิเคราะห์นโยบายและแผน Fulltime ชาย";
  var s321f1 = "นักวิเคราะห์นโยบายและแผน ขรก/พนักงานของรัฐหญิง";
  var s321f5 = "นักวิเคราะห์นโยบายและแผน Fulltime หญิง";
  var s322m1 = "นักวิเคราะห์นโยบายและแผน ลูกจ้างชาย";
  var s322m5 = "นักวิเคราะห์นโยบายและแผน Parttime ชาย";
  var s322f1 = "นักวิเคราะห์นโยบายและแผน ลูกจ้างหญิง";
  var s322f5 = "นักวิเคราะห์นโยบายและแผน Parttime หญิง";

  var s331m1 = "ผู้ปฏิบัติงานด้านการแพทย์แผนไทย ขรก/พนักงานของรัฐชาย";
  var s331m5 = "ผู้ปฏิบัติงานด้านการแพทย์แผนไทย Fulltime ชาย";
  var s331f1 = "ผู้ปฏิบัติงานด้านการแพทย์แผนไทย ขรก/พนักงานของรัฐหญิง";
  var s331f5 = "ผู้ปฏิบัติงานด้านการแพทย์แผนไทย Fulltime หญิง";
  var s332m1 = "ผู้ปฏิบัติงานด้านการแพทย์แผนไทย ลูกจ้างชาย";
  var s332m5 = "ผู้ปฏิบัติงานด้านการแพทย์แผนไทย Parttime ชาย";
  var s332f1 = "ผู้ปฏิบัติงานด้านการแพทย์แผนไทย ลูกจ้างหญิง";
  var s332f5 = "ผู้ปฏิบัติงานด้านการแพทย์แผนไทย Parttime หญิง";

  var s341m1 = "นักวิชาการเงินและบัญชี ขรก/พนักงานของรัฐชาย";
  var s341m5 = "นักวิชาการเงินและบัญชี Fulltime ชาย";
  var s341f1 = "นักวิชาการเงินและบัญชี ขรก/พนักงานของรัฐหญิง";
  var s341f5 = "นักวิชาการเงินและบัญชี Fulltime หญิง";
  var s342m1 = "นักวิชาการเงินและบัญชี ลูกจ้างชาย";
  var s342m5 = "นักวิชาการเงินและบัญชี Parttime ชาย";
  var s342f1 = "นักวิชาการเงินและบัญชี ลูกจ้างหญิง";
  var s342f5 = "นักวิชาการเงินและบัญชี Parttime หญิง";

  var s351m1 = "นักวิชาการคอมพิวเตอร์ ขรก/พนักงานของรัฐชาย";
  var s351m5 = "นักวิชาการคอมพิวเตอร์ Fulltime ชาย";
  var s351f1 = "นักวิชาการคอมพิวเตอร์ ขรก/พนักงานของรัฐหญิง";
  var s351f5 = "นักวิชาการคอมพิวเตอร์ Fulltime หญิง";
  var s352m1 = "นักวิชาการคอมพิวเตอร์ ลูกจ้างชาย";
  var s352m5 = "นักวิชาการคอมพิวเตอร์ Parttime ชาย";
  var s352f1 = "นักวิชาการคอมพิวเตอร์ ลูกจ้างหญิง";
  var s352f5 = "นักวิชาการคอมพิวเตอร์ Parttime หญิง";

  var s361m1 = "นักจัดการงานทั่วไป ขรก/พนักงานของรัฐชาย";
  var s361m5 = "นักจัดการงานทั่วไป Fulltime ชาย";
  var s361f1 = "นักจัดการงานทั่วไป ขรก/พนักงานของรัฐหญิง";
  var s361f5 = "นักจัดการงานทั่วไป Fulltime หญิง";
  var s362m1 = "นักจัดการงานทั่วไป ลูกจ้างชาย";
  var s362m5 = "นักจัดการงานทั่วไป Parttime ชาย";
  var s362f1 = "นักจัดการงานทั่วไป ลูกจ้างหญิง";
  var s362f5 = "นักจัดการงานทั่วไป Parttime หญิง";

  var s371m1 = "นักทรัพยากรบุคคล ขรก/พนักงานของรัฐชาย";
  var s371m5 = "นักทรัพยากรบุคคล Fulltime ชาย";
  var s371f1 = "นักทรัพยากรบุคคล ขรก/พนักงานของรัฐหญิง";
  var s371f5 = "นักทรัพยากรบุคคล Fulltime หญิง";
  var s372m1 = "นักทรัพยากรบุคคล ลูกจ้างชาย";
  var s372m5 = "นักทรัพยากรบุคคล Parttime ชาย";
  var s372f1 = "นักทรัพยากรบุคคล ลูกจ้างหญิง";
  var s372f5 = "นักทรัพยากรบุคคล Parttime หญิง";

  var s381m1 = "เจ้าพนักงานโสตทัศนศึกษา ขรก/พนักงานของรัฐชาย";
  var s381m5 = "เจ้าพนักงานโสตทัศนศึกษา Fulltime ชาย";
  var s381f1 = "เจ้าพนักงานโสตทัศนศึกษา ขรก/พนักงานของรัฐหญิง";
  var s381f5 = "เจ้าพนักงานโสตทัศนศึกษา Fulltime หญิง";
  var s382m1 = "เจ้าพนักงานโสตทัศนศึกษา ลูกจ้างชาย";
  var s382m5 = "เจ้าพนักงานโสตทัศนศึกษา Parttime ชาย";
  var s382f1 = "เจ้าพนักงานโสตทัศนศึกษา ลูกจ้างหญิง";
  var s382f5 = "เจ้าพนักงานโสตทัศนศึกษา Parttime หญิง";

  var s391m1 = "นักวิชาการอาหารและยา ขรก/พนักงานของรัฐชาย";
  var s391m5 = "นักวิชาการอาหารและยา Fulltime ชาย";
  var s391f1 = "นักวิชาการอาหารและยา ขรก/พนักงานของรัฐหญิง";
  var s391f5 = "นักวิชาการอาหารและยา Fulltime หญิง";
  var s392m1 = "นักวิชาการอาหารและยา ลูกจ้างชาย";
  var s392m5 = "นักวิชาการอาหารและยา Parttime ชาย";
  var s392f1 = "นักวิชาการอาหารและยา ลูกจ้างหญิง";
  var s392f5 = "นักวิชาการอาหารและยา Parttime หญิง";

  var s401m1 = "นักกิจกรรมบำบัด ขรก/พนักงานของรัฐชาย";
  var s401m5 = "นักกิจกรรมบำบัด Fulltime ชาย";
  var s401f1 = "นักกิจกรรมบำบัด ขรก/พนักงานของรัฐหญิง";
  var s401f5 = "นักกิจกรรมบำบัด Fulltime หญิง";
  var s402m1 = "นักกิจกรรมบำบัด ลูกจ้างชาย";
  var s402m5 = "นักกิจกรรมบำบัด Parttime ชาย";
  var s402f1 = "นักกิจกรรมบำบัด ลูกจ้างหญิง";
  var s402f5 = "นักกิจกรรมบำบัด Parttime หญิง";
}
else
{
  var s011m1 = "นายแพทย์ ขรก/พนักงานของรัฐชาย";
  var s011m5 = "นายแพทย์ Fulltime ชาย";
  var s011f1 = "นายแพทย์ ขรก/พนักงานของรัฐหญิง";
  var s011f5 = "นายแพทย์ Fulltime หญิง";
  var s012m1 = "นายแพทย์ ลูกจ้างชาย";
  var s012m5 = "นายแพทย์ Parttime ชาย";
  var s012f1 = "นายแพทย์ ลูกจ้างหญิง";
  var s012f5 = "นายแพทย์ Parttime หญิง";

  var s021m1 = "ทันตแพทย์ ขรก/พนักงานของรัฐชาย";
  var s021m5 = "ทันตแพทย์ Fulltime ชาย";
  var s021f1 = "ทันตแพทย์ ขรก/พนักงานของรัฐหญิง";
  var s021f5 = "ทันตแพทย์ Fulltime หญิง";
  var s022m1 = "ทันตแพทย์ ลูกจ้างชาย";
  var s022m5 = "ทันตแพทย์ Parttime ชาย";
  var s022f1 = "ทันตแพทย์ ลูกจ้างหญิง";
  var s022f5 = "ทันตแพทย์ Parttime หญิง";

  var s031m1 = "ผู้ช่วยทันตแพทย์ ขรก/พนักงานของรัฐชาย";
  var s031m5 = "ผู้ช่วยทันตแพทย์ Fulltime ชาย";
  var s031f1 = "ผู้ช่วยทันตแพทย์ ขรก/พนักงานของรัฐหญิง";
  var s031f5 = "ผู้ช่วยทันตแพทย์ Fulltime หญิง";
  var s032m1 = "ผู้ช่วยทันตแพทย์ ลูกจ้างชาย";
  var s032m5 = "ผู้ช่วยทันตแพทย์ Parttime ชาย";
  var s032f1 = "ผู้ช่วยทันตแพทย์ ลูกจ้างหญิง";
  var s032f5 = "ผู้ช่วยทันตแพทย์ Parttime หญิง";

  var s041m1 = "ช่างทันตกรรม ขรก/พนักงานของรัฐชาย";
  var s041m5 = "ช่างทันตกรรม Fulltime ชาย";
  var s041f1 = "ช่างทันตกรรม ขรก/พนักงานของรัฐหญิง";
  var s041f5 = "ช่างทันตกรรม Fulltime หญิง";
  var s042m1 = "ช่างทันตกรรม ลูกจ้างชาย";
  var s042m5 = "ช่างทันตกรรม Parttime ชาย";
  var s042f1 = "ช่างทันตกรรม ลูกจ้างหญิง";
  var s042f5 = "ช่างทันตกรรม Parttime หญิง";

  var s051m1 = "ทันตาภิบาล/ เจ้าพนักงานทันตสาธารณสุข ขรก/พนักงานของรัฐชาย";
  var s051m5 = "ทันตาภิบาล/ เจ้าพนักงานทันตสาธารณสุข Fulltime ชาย";
  var s051f1 = "ทันตาภิบาล/ เจ้าพนักงานทันตสาธารณสุข ขรก/พนักงานของรัฐหญิง";
  var s051f5 = "ทันตาภิบาล/ เจ้าพนักงานทันตสาธารณสุข Fulltime หญิง";
  var s052m1 = "ทันตาภิบาล/ เจ้าพนักงานทันตสาธารณสุข ลูกจ้างชาย";
  var s052m5 = "ทันตาภิบาล/ เจ้าพนักงานทันตสาธารณสุข Parttime ชาย";
  var s052f1 = "ทันตาภิบาล/ เจ้าพนักงานทันตสาธารณสุข ลูกจ้างหญิง";
  var s052f5 = "ทันตาภิบาล/ เจ้าพนักงานทันตสาธารณสุข Parttime หญิง";

  var s061m1 = "สัตวแพทย์ ขรก/พนักงานของรัฐชาย";
  var s061m5 = "สัตวแพทย์ Fulltime ชาย";
  var s061f1 = "สัตวแพทย์ ขรก/พนักงานของรัฐหญิง";
  var s061f5 = "สัตวแพทย์ Fulltime หญิง";
  var s062m1 = "สัตวแพทย์ ลูกจ้างชาย";
  var s062m5 = "สัตวแพทย์ Parttime ชาย";
  var s062f1 = "สัตวแพทย์ ลูกจ้างหญิง";
  var s062f5 = "สัตวแพทย์ Parttime หญิง";

  var s071m1 = "ผู้ช่วยสัตวแพทย์ ขรก/พนักงานของรัฐชาย";
  var s071m5 = "ผู้ช่วยสัตวแพทย์ Fulltime ชาย";
  var s071f1 = "ผู้ช่วยสัตวแพทย์ ขรก/พนักงานของรัฐหญิง";
  var s071f5 = "ผู้ช่วยสัตวแพทย์ Fulltime หญิง";
  var s072m1 = "ผู้ช่วยสัตวแพทย์ ลูกจ้างชาย";
  var s072m5 = "ผู้ช่วยสัตวแพทย์ Parttime ชาย";
  var s072f1 = "ผู้ช่วยสัตวแพทย์ ลูกจ้างหญิง";
  var s072f5 = "ผู้ช่วยสัตวแพทย์ Parttime หญิง";

  var s081m1 = "เภสัชกร ขรก/พนักงานของรัฐชาย";
  var s081m5 = "เภสัชกร Fulltime ชาย";
  var s081f1 = "เภสัชกร ขรก/พนักงานของรัฐหญิง";
  var s081f5 = "เภสัชกร Fulltime หญิง";
  var s082m1 = "เภสัชกร ลูกจ้างชาย";
  var s082m5 = "เภสัชกร Parttime ชาย";
  var s082f1 = "เภสัชกร ลูกจ้างหญิง";
  var s082f5 = "เภสัชกร Parttime หญิง";

  var s091m1 = "ผู้ช่วยเภสัชกร/เจ้าพนักงานเภสัชกรรม ขรก/พนักงานของรัฐชาย";
  var s091m5 = "ผู้ช่วยเภสัชกร/เจ้าพนักงานเภสัชกรรม Fulltime ชาย";
  var s091f1 = "ผู้ช่วยเภสัชกร/เจ้าพนักงานเภสัชกรรม ขรก/พนักงานของรัฐหญิง";
  var s091f5 = "ผู้ช่วยเภสัชกร/เจ้าพนักงานเภสัชกรรม Fulltime หญิง";
  var s092m1 = "ผู้ช่วยเภสัชกร/เจ้าพนักงานเภสัชกรรม ลูกจ้างชาย";
  var s092m5 = "ผู้ช่วยเภสัชกร/เจ้าพนักงานเภสัชกรรม Parttime ชาย";
  var s092f1 = "ผู้ช่วยเภสัชกร/เจ้าพนักงานเภสัชกรรม ลูกจ้างหญิง";
  var s092f5 = "ผู้ช่วยเภสัชกร/เจ้าพนักงานเภสัชกรรม Parttime หญิง";

  var s101m1 = "พยาบาลวิชาชีพ ขรก/พนักงานของรัฐชาย";
  var s101m5 = "พยาบาลวิชาชีพ Fulltime ชาย";
  var s101f1 = "พยาบาลวิชาชีพ ขรก/พนักงานของรัฐหญิง";
  var s101f5 = "พยาบาลวิชาชีพ Fulltime หญิง";
  var s102m1 = "พยาบาลวิชาชีพ ลูกจ้างชาย";
  var s102m5 = "พยาบาลวิชาชีพ Parttime ชาย";
  var s102f1 = "พยาบาลวิชาชีพ ลูกจ้างหญิง";
  var s102f5 = "พยาบาลวิชาชีพ Parttime หญิง";

  var s111m1 = "พยาบาลเทคนิค ขรก/พนักงานของรัฐชาย";
  var s111m5 = "พยาบาลเทคนิค Fulltime ชาย";
  var s111f1 = "พยาบาลเทคนิค ขรก/พนักงานของรัฐหญิง";
  var s111f5 = "พยาบาลเทคนิค Fulltime หญิง";
  var s112m1 = "พยาบาลเทคนิค ลูกจ้างชาย";
  var s112m5 = "พยาบาลเทคนิค Parttime ชาย";
  var s112f1 = "พยาบาลเทคนิค ลูกจ้างหญิง";
  var s112f5 = "พยาบาลเทคนิค Parttime หญิง";

  var s121m1 = "วิสัญญีพยาบาล ขรก/พนักงานของรัฐชาย";
  var s121m5 = "วิสัญญีพยาบาล Fulltime ชาย";
  var s121f1 = "วิสัญญีพยาบาล ขรก/พนักงานของรัฐหญิง";
  var s121f5 = "วิสัญญีพยาบาล Fulltime หญิง";
  var s122m1 = "วิสัญญีพยาบาล ลูกจ้างชาย";
  var s122m5 = "วิสัญญีพยาบาล Parttime ชาย";
  var s122f1 = "วิสัญญีพยาบาล ลูกจ้างหญิง";
  var s122f5 = "วิสัญญีพยาบาล Parttime หญิง";

  var s131m1 = "เจ้าหน้าที่/ผู้ช่วยพยาบาล ขรก/พนักงานของรัฐชาย";
  var s131m5 = "เจ้าหน้าที่/ผู้ช่วยพยาบาล Fulltime ชาย";
  var s131f1 = "เจ้าหน้าที่/ผู้ช่วยพยาบาล ขรก/พนักงานของรัฐหญิง";
  var s131f5 = "เจ้าหน้าที่/ผู้ช่วยพยาบาล Fulltime หญิง";
  var s132m1 = "เจ้าหน้าที่/ผู้ช่วยพยาบาล ลูกจ้างชาย";
  var s132m5 = "เจ้าหน้าที่/ผู้ช่วยพยาบาล Parttime ชาย";
  var s132f1 = "เจ้าหน้าที่/ผู้ช่วยพยาบาล ลูกจ้างหญิง";
  var s132f5 = "เจ้าหน้าที่/ผู้ช่วยพยาบาล Parttime หญิง";

  var s141m1 = "ผดุงครรภ์ ขรก/พนักงานของรัฐชาย";
  var s141m5 = "ผดุงครรภ์ Fulltime ชาย";
  var s141f1 = "ผดุงครรภ์ ขรก/พนักงานของรัฐหญิง";
  var s141f5 = "ผดุงครรภ์ Fulltime หญิง";
  var s142m1 = "ผดุงครรภ์ ลูกจ้างชาย";
  var s142m5 = "ผดุงครรภ์ Parttime ชาย";
  var s142f1 = "ผดุงครรภ์ ลูกจ้างหญิง";
  var s142f5 = "ผดุงครรภ์ Parttime หญิง";

  var s151m1 = "นักวิชาการสุขศึกษา ขรก/พนักงานของรัฐชาย";
  var s151m5 = "นักวิชาการสุขศึกษา Fulltime ชาย";
  var s151f1 = "นักวิชาการสุขศึกษา ขรก/พนักงานของรัฐหญิง";
  var s151f5 = "นักวิชาการสุขศึกษา Fulltime หญิง";
  var s152m1 = "นักวิชาการสุขศึกษา ลูกจ้างชาย";
  var s152m5 = "นักวิชาการสุขศึกษา Parttime ชาย";
  var s152f1 = "นักวิชาการสุขศึกษา ลูกจ้างหญิง";
  var s152f5 = "นักวิชาการสุขศึกษา Parttime หญิง";

  var s161m1 = "นักวิชาการสุขาภิบาล ขรก/พนักงานของรัฐชาย";
  var s161m5 = "นักวิชาการสุขาภิบาล Fulltime ชาย";
  var s161f1 = "นักวิชาการสุขาภิบาล ขรก/พนักงานของรัฐหญิง";
  var s161f5 = "นักวิชาการสุขาภิบาล Fulltime หญิง";
  var s162m1 = "นักวิชาการสุขาภิบาล ลูกจ้างชาย";
  var s162m5 = "นักวิชาการสุขาภิบาล Parttime ชาย";
  var s162f1 = "นักวิชาการสุขาภิบาล ลูกจ้างหญิง";
  var s162f5 = "นักวิชาการสุขาภิบาล Parttime หญิง";

  var s171m1 = "นักวิชาการส่งเสริมสุขภาพ ขรก/พนักงานของรัฐชาย";
  var s171m5 = "นักวิชาการส่งเสริมสุขภาพ Fulltime ชาย";
  var s171f1 = "นักวิชาการส่งเสริมสุขภาพ ขรก/พนักงานของรัฐหญิง";
  var s171f5 = "นักวิชาการส่งเสริมสุขภาพ Fulltime หญิง";
  var s172m1 = "นักวิชาการส่งเสริมสุขภาพ ลูกจ้างชาย";
  var s172m5 = "นักวิชาการส่งเสริมสุขภาพ Parttime ชาย";
  var s172f1 = "นักวิชาการส่งเสริมสุขภาพ ลูกจ้างหญิง";
  var s172f5 = "นักวิชาการส่งเสริมสุขภาพ Parttime หญิง";

  var s181m1 = "นักวิชาการควบคุมโรค ขรก/พนักงานของรัฐชาย";
  var s181m5 = "นักวิชาการควบคุมโรค Fulltime ชาย";
  var s181f1 = "นักวิชาการควบคุมโรค ขรก/พนักงานของรัฐหญิง";
  var s181f5 = "นักวิชาการควบคุมโรค Fulltime หญิง";
  var s182m1 = "นักวิชาการควบคุมโรค ลูกจ้างชาย";
  var s182m5 = "นักวิชาการควบคุมโรค Parttime ชาย";
  var s182f1 = "นักวิชาการควบคุมโรค ลูกจ้างหญิง";
  var s182f5 = "นักวิชาการควบคุมโรค Parttime หญิง";

  var s191m1 = "นักกายภาพบำบัด ขรก/พนักงานของรัฐชาย";
  var s191m5 = "นักกายภาพบำบัด Fulltime ชาย";
  var s191f1 = "นักกายภาพบำบัด ขรก/พนักงานของรัฐหญิง";
  var s191f5 = "นักกายภาพบำบัด Fulltime หญิง";
  var s192m1 = "นักกายภาพบำบัด ลูกจ้างชาย";
  var s192m5 = "นักกายภาพบำบัด Parttime ชาย";
  var s192f1 = "นักกายภาพบำบัด ลูกจ้างหญิง";
  var s192f5 = "นักกายภาพบำบัด Parttime หญิง";

  var s201m1 = "ผู้ช่วยกายภาพบำบัด ขรก/พนักงานของรัฐชาย";
  var s201m5 = "ผู้ช่วยกายภาพบำบัด Fulltime ชาย";
  var s201f1 = "ผู้ช่วยกายภาพบำบัด ขรก/พนักงานของรัฐหญิง";
  var s201f5 = "ผู้ช่วยกายภาพบำบัด Fulltime หญิง";
  var s202m1 = "ผู้ช่วยกายภาพบำบัด ลูกจ้างชาย";
  var s202m5 = "ผู้ช่วยกายภาพบำบัด Parttime ชาย";
  var s202f1 = "ผู้ช่วยกายภาพบำบัด ลูกจ้างหญิง";
  var s202f5 = "ผู้ช่วยกายภาพบำบัด Parttime หญิง";

  var s211m1 = "นักอาชีวบำบัด ขรก/พนักงานของรัฐชาย";
  var s211m5 = "นักอาชีวบำบัด Fulltime ชาย";
  var s211f1 = "นักอาชีวบำบัด ขรก/พนักงานของรัฐหญิง";
  var s211f5 = "นักอาชีวบำบัด Fulltime หญิง";
  var s212m1 = "นักอาชีวบำบัด ลูกจ้างชาย";
  var s212m5 = "นักอาชีวบำบัด Parttime ชาย";
  var s212f1 = "นักอาชีวบำบัด ลูกจ้างหญิง";
  var s212f5 = "นักอาชีวบำบัด Parttime หญิง";

  var s221m1 = "เจ้าพนักงาน/พนักงานอาชีวบำบัด ขรก/พนักงานของรัฐชาย";
  var s221m5 = "เจ้าพนักงาน/พนักงานอาชีวบำบัด Fulltime ชาย";
  var s221f1 = "เจ้าพนักงาน/พนักงานอาชีวบำบัด ขรก/พนักงานของรัฐหญิง";
  var s221f5 = "เจ้าพนักงาน/พนักงานอาชีวบำบัด Fulltime หญิง";
  var s222m1 = "เจ้าพนักงาน/พนักงานอาชีวบำบัด ลูกจ้างชาย";
  var s222m5 = "เจ้าพนักงาน/พนักงานอาชีวบำบัด Parttime ชาย";
  var s222f1 = "เจ้าพนักงาน/พนักงานอาชีวบำบัด ลูกจ้างหญิง";
  var s222f5 = "เจ้าพนักงาน/พนักงานอาชีวบำบัด Parttime หญิง";

  var s231m1 = "เจ้าพนักงานเวชกรรมฟื้นฟู ขรก/พนักงานของรัฐชาย";
  var s231m5 = "เจ้าพนักงานเวชกรรมฟื้นฟู Fulltime ชาย";
  var s231f1 = "เจ้าพนักงานเวชกรรมฟื้นฟู ขรก/พนักงานของรัฐหญิง";
  var s231f5 = "เจ้าพนักงานเวชกรรมฟื้นฟู Fulltime หญิง";
  var s232m1 = "เจ้าพนักงานเวชกรรมฟื้นฟู ลูกจ้างชาย";
  var s232m5 = "เจ้าพนักงานเวชกรรมฟื้นฟู Parttime ชาย";
  var s232f1 = "เจ้าพนักงานเวชกรรมฟื้นฟู ลูกจ้างหญิง";
  var s232f5 = "เจ้าพนักงานเวชกรรมฟื้นฟู Parttime หญิง";

  var s241m1 = "นักเทคนิคการแพทย์ ขรก/พนักงานของรัฐชาย";
  var s241m5 = "นักเทคนิคการแพทย์ Fulltime ชาย";
  var s241f1 = "นักเทคนิคการแพทย์ ขรก/พนักงานของรัฐหญิง";
  var s241f5 = "นักเทคนิคการแพทย์ Fulltime หญิง";
  var s242m1 = "นักเทคนิคการแพทย์ ลูกจ้างชาย";
  var s242m5 = "นักเทคนิคการแพทย์ Parttime ชาย";
  var s242f1 = "นักเทคนิคการแพทย์ ลูกจ้างหญิง";
  var s242f5 = "นักเทคนิคการแพทย์ Parttime หญิง";

  var s251m1 = "นักวิทยาศาสตร์การแพทย์ ขรก/พนักงานของรัฐชาย";
  var s251m5 = "นักวิทยาศาสตร์การแพทย์ Fulltime ชาย";
  var s251f1 = "นักวิทยาศาสตร์การแพทย์ ขรก/พนักงานของรัฐหญิง";
  var s251f5 = "นักวิทยาศาสตร์การแพทย์ Fulltime หญิง";
  var s252m1 = "นักวิทยาศาสตร์การแพทย์ ลูกจ้างชาย";
  var s252m5 = "นักวิทยาศาสตร์การแพทย์ Parttime ชาย";
  var s252f1 = "นักวิทยาศาสตร์การแพทย์ ลูกจ้างหญิง";
  var s252f5 = "นักวิทยาศาสตร์การแพทย์ Parttime หญิง";

  var s261m1 = "เจ้าหน้าที่วิทยาศาสตร์การแพทย์ ขรก/พนักงานของรัฐชาย";
  var s261m5 = "เจ้าหน้าที่วิทยาศาสตร์การแพทย์ Fulltime ชาย";
  var s261f1 = "เจ้าหน้าที่วิทยาศาสตร์การแพทย์ ขรก/พนักงานของรัฐหญิง";
  var s261f5 = "เจ้าหน้าที่วิทยาศาสตร์การแพทย์ Fulltime หญิง";
  var s262m1 = "เจ้าหน้าที่วิทยาศาสตร์การแพทย์ ลูกจ้างชาย";
  var s262m5 = "เจ้าหน้าที่วิทยาศาสตร์การแพทย์ Parttime ชาย";
  var s262f1 = "เจ้าหน้าที่วิทยาศาสตร์การแพทย์ ลูกจ้างหญิง";
  var s262f5 = "เจ้าหน้าที่วิทยาศาสตร์การแพทย์ Parttime หญิง";

 var s271m1 = "เจ้าพนักงานวิทยาศาสตร์การแพทย์ ขรก/พนักงานของรัฐชาย";
  var s271m5 = "เจ้าพนักงานวิทยาศาสตร์การแพทย์ Fulltime ชาย";
  var s271f1 = "เจ้าพนักงานวิทยาศาสตร์การแพทย์ ขรก/พนักงานของรัฐหญิง";
  var s271f5 = "เจ้าพนักงานวิทยาศาสตร์การแพทย์ Fulltime หญิง";
  var s272m1 = "เจ้าพนักงานวิทยาศาสตร์การแพทย์ ลูกจ้างชาย";
  var s272m5 = "เจ้าพนักงานวิทยาศาสตร์การแพทย์ Parttime ชาย";
  var s272f1 = "เจ้าพนักงานวิทยาศาสตร์การแพทย์ ลูกจ้างหญิง";
  var s272f5 = "เจ้าพนักงานวิทยาศาสตร์การแพทย์ Parttime หญิง";

  var s281m1 = "นักฟิสิกรังสี ขรก/พนักงานของรัฐชาย";
  var s281m5 = "นักฟิสิกรังสี Fulltime ชาย";
  var s281f1 = "นักฟิสิกรังสี ขรก/พนักงานของรัฐหญิง";
  var s281f5 = "นักฟิสิกรังสี Fulltime หญิง";
  var s282m1 = "นักฟิสิกรังสี ลูกจ้างชาย";
  var s282m5 = "นักฟิสิกรังสี Parttime ชาย";
  var s282f1 = "นักฟิสิกรังสี ลูกจ้างหญิง";
  var s282f5 = "นักฟิสิกรังสี Parttime หญิง";

  var s291m1 = "นักรังสีการแพทย์ ขรก/พนักงานของรัฐชาย";
  var s291m5 = "นักรังสีการแพทย์ Fulltime ชาย";
  var s291f1 = "นักรังสีการแพทย์ ขรก/พนักงานของรัฐหญิง";
  var s291f5 = "นักรังสีการแพทย์ Fulltime หญิง";
  var s292m1 = "นักรังสีการแพทย์ ลูกจ้างชาย";
  var s292m5 = "นักรังสีการแพทย์ Parttime ชาย";
  var s292f1 = "นักรังสีการแพทย์ ลูกจ้างหญิง";
  var s292f5 = "นักรังสีการแพทย์ Parttime หญิง";

  var s301m1 = "เจ้าหน้าที่/พนักงานรังสีการแพทย์/เทคนิค ขรก/พนักงานของรัฐชาย";
  var s301m5 = "เจ้าหน้าที่/พนักงานรังสีการแพทย์/เทคนิค Fulltime ชาย";
  var s301f1 = "เจ้าหน้าที่/พนักงานรังสีการแพทย์/เทคนิค ขรก/พนักงานของรัฐหญิง";
  var s301f5 = "เจ้าหน้าที่/พนักงานรังสีการแพทย์/เทคนิค Fulltime หญิง";
  var s302m1 = "เจ้าหน้าที่/พนักงานรังสีการแพทย์/เทคนิค ลูกจ้างชาย";
  var s302m5 = "เจ้าหน้าที่/พนักงานรังสีการแพทย์/เทคนิค Parttime ชาย";
  var s302f1 = "เจ้าหน้าที่/พนักงานรังสีการแพทย์/เทคนิค ลูกจ้างหญิง";
  var s302f5 = "เจ้าหน้าที่/พนักงานรังสีการแพทย์/เทคนิค Parttime หญิง";

  var s311m1 = "นักโภชนาการ ขรก/พนักงานของรัฐชาย";
  var s311m5 = "นักโภชนาการ Fulltime ชาย";
  var s312f1 = "นักโภชนาการ ขรก/พนักงานของรัฐหญิง";
  var s312f5 = "นักโภชนาการ Fulltime หญิง";
  var s311m1 = "นักโภชนาการ ลูกจ้างชาย";
  var s312m5 = "นักโภชนาการ Parttime ชาย";
  var s312f1 = "นักโภชนาการ ลูกจ้างหญิง";
  var s312f5 = "นักโภชนาการ Parttime หญิง";

  var s321m1 = "โภชนากร ขรก/พนักงานของรัฐชาย";
  var s321m5 = "โภชนากร Fulltime ชาย";
  var s321f1 = "โภชนากร ขรก/พนักงานของรัฐหญิง";
  var s321f5 = "โภชนากร Fulltime หญิง";
  var s322m1 = "โภชนากร ลูกจ้างชาย";
  var s322m5 = "โภชนากร Parttime ชาย";
  var s322f1 = "โภชนากร ลูกจ้างหญิง";
  var s322f5 = "โภชนากร Parttime หญิง";

  var s331m1 = "นักจิตวิทยา ขรก/พนักงานของรัฐชาย";
  var s331m5 = "นักจิตวิทยา Fulltime ชาย";
  var s331f1 = "นักจิตวิทยา ขรก/พนักงานของรัฐหญิง";
  var s331f5 = "นักจิตวิทยา Fulltime หญิง";
  var s332m1 = "นักจิตวิทยา ลูกจ้างชาย";
  var s332m5 = "นักจิตวิทยา Parttime ชาย";
  var s332f1 = "นักจิตวิทยา ลูกจ้างหญิง";
  var s332f5 = "นักจิตวิทยา Parttime หญิง";

  var s341m1 = "นักสังคมสงเคราะห์ ขรก/พนักงานของรัฐชาย";
  var s341m5 = "นักสังคมสงเคราะห์ Fulltime ชาย";
  var s341f1 = "นักสังคมสงเคราะห์ ขรก/พนักงานของรัฐหญิง";
  var s341f5 = "นักสังคมสงเคราะห์ Fulltime หญิง";
  var s342m1 = "นักสังคมสงเคราะห์ ลูกจ้างชาย";
  var s342m5 = "นักสังคมสงเคราะห์ Parttime ชาย";
  var s342f1 = "นักสังคมสงเคราะห์ ลูกจ้างหญิง";
  var s342f5 = "นักสังคมสงเคราะห์ Parttime หญิง";

  var s351m1 = "นักสถิติ/นักเวชสถิติ ขรก/พนักงานของรัฐชาย";
  var s351m5 = "นักสถิติ/นักเวชสถิติ Fulltime ชาย";
  var s351f1 = "นักสถิติ/นักเวชสถิติ ขรก/พนักงานของรัฐหญิง";
  var s351f5 = "นักสถิติ/นักเวชสถิติ Fulltime หญิง";
  var s352m1 = "นักสถิติ/นักเวชสถิติ ลูกจ้างชาย";
  var s352m5 = "นักสถิติ/นักเวชสถิติ Parttime ชาย";
  var s352f1 = "นักสถิติ/นักเวชสถิติ ลูกจ้างหญิง";
  var s352f5 = "นักสถิติ/นักเวชสถิติ Parttime หญิง";

  var s361m1 = "เจ้าหน้าที่เวชสถิติ ขรก/พนักงานของรัฐชาย";
  var s361m5 = "เจ้าหน้าที่เวชสถิติ Fulltime ชาย";
  var s361f1 = "เจ้าหน้าที่เวชสถิติ ขรก/พนักงานของรัฐหญิง";
  var s361f5 = "เจ้าหน้าที่เวชสถิติ Fulltime หญิง";
  var s362m1 = "เจ้าหน้าที่เวชสถิติ ลูกจ้างชาย";
  var s362m5 = "เจ้าหน้าที่เวชสถิติ Parttime ชาย";
  var s362f1 = "เจ้าหน้าที่เวชสถิติ ลูกจ้างหญิง";
  var s362f5 = "เจ้าหน้าที่เวชสถิติ Parttime หญิง";

  var s371m1 = "เจ้าพนักงาน/เจ้าหน้าที่สถิติ ขรก/พนักงานของรัฐชาย";
  var s371m5 = "เจ้าพนักงาน/เจ้าหน้าที่สถิติ Fulltime ชาย";
  var s371f1 = "เจ้าพนักงาน/เจ้าหน้าที่สถิติ ขรก/พนักงานของรัฐหญิง";
  var s371f5 = "เจ้าพนักงาน/เจ้าหน้าที่สถิติ Fulltime หญิง";
  var s372m1 = "เจ้าพนักงาน/เจ้าหน้าที่สถิติ ลูกจ้างชาย";
  var s372m5 = "เจ้าพนักงาน/เจ้าหน้าที่สถิติ Parttime ชาย";
  var s372f1 = "เจ้าพนักงาน/เจ้าหน้าที่สถิติ ลูกจ้างหญิง";
  var s372f5 = "เจ้าพนักงาน/เจ้าหน้าที่สถิติ Parttime หญิง";

  var s381m1 = "นักวิชาการสาธารณสุข ขรก/พนักงานของรัฐชาย";
  var s381m5 = "นักวิชาการสาธารณสุข Fulltime ชาย";
  var s381f1 = "นักวิชาการสาธารณสุข ขรก/พนักงานของรัฐหญิง";
  var s381f5 = "นักวิชาการสาธารณสุข Fulltime หญิง";
  var s382m1 = "นักวิชาการสาธารณสุข ลูกจ้างชาย";
  var s382m5 = "นักวิชาการสาธารณสุข Parttime ชาย";
  var s382f1 = "นักวิชาการสาธารณสุข ลูกจ้างหญิง";
  var s382f5 = "นักวิชาการสาธารณสุข Parttime หญิง";

  var s391m1 = "เจ้าหน้าที่บริหารงานสาธารณสุข ขรก/พนักงานของรัฐชาย";
  var s391m5 = "เจ้าหน้าที่บริหารงานสาธารณสุข Fulltime ชาย";
  var s391f1 = "เจ้าหน้าที่บริหารงานสาธารณสุข ขรก/พนักงานของรัฐหญิง";
  var s391f5 = "เจ้าหน้าที่บริหารงานสาธารณสุข Fulltime หญิง";
  var s392m1 = "เจ้าหน้าที่บริหารงานสาธารณสุข ลูกจ้างชาย";
  var s392m5 = "เจ้าหน้าที่บริหารงานสาธารณสุข Parttime ชาย";
  var s392f1 = "เจ้าหน้าที่บริหารงานสาธารณสุข ลูกจ้างหญิง";
  var s392f5 = "เจ้าหน้าที่บริหารงานสาธารณสุข Parttime หญิง";

  var s401m1 = "เจ้าพนักงานสาธารณสุขชุมชน/ควบคุมโรค ขรก/พนักงานของรัฐชาย";
  var s401m5 = "เจ้าพนักงานสาธารณสุขชุมชน/ควบคุมโรค Fulltime ชาย";
  var s401f1 = "เจ้าพนักงานสาธารณสุขชุมชน/ควบคุมโรค ขรก/พนักงานของรัฐหญิง";
  var s401f5 = "เจ้าพนักงานสาธารณสุขชุมชน/ควบคุมโรค Fulltime หญิง";
  var s402m1 = "เจ้าพนักงานสาธารณสุขชุมชน/ควบคุมโรค ลูกจ้างชาย";
  var s402m5 = "เจ้าพนักงานสาธารณสุขชุมชน/ควบคุมโรค Parttime ชาย";
  var s402f1 = "เจ้าพนักงานสาธารณสุขชุมชน/ควบคุมโรค ลูกจ้างหญิง";
  var s402f5 = "เจ้าพนักงานสาธารณสุขชุมชน/ควบคุมโรค Parttime หญิง";

  var s411m1 = "เจ้าหน้าที่วิเคราะห์นโยบายและแผน ขรก/พนักงานของรัฐชาย";
  var s411m5 = "เจ้าหน้าที่วิเคราะห์นโยบายและแผน Fulltime ชาย";
  var s411f1 = "เจ้าหน้าที่วิเคราะห์นโยบายและแผน ขรก/พนักงานของรัฐหญิง";
  var s411f5 = "เจ้าหน้าที่วิเคราะห์นโยบายและแผน Fulltime หญิง";
  var s412m1 = "เจ้าหน้าที่วิเคราะห์นโยบายและแผน ลูกจ้างชาย";
  var s412m5 = "เจ้าหน้าที่วิเคราะห์นโยบายและแผน Parttime ชาย";
  var s412f1 = "เจ้าหน้าที่วิเคราะห์นโยบายและแผน ลูกจ้างหญิง";
  var s412f5 = "เจ้าหน้าที่วิเคราะห์นโยบายและแผน Parttime หญิง";

  var s421m1 = "ผู้ปฏิบัติงานด้านการแพทย์แผนไทย ขรก/พนักงานของรัฐชาย";
  var s421m5 = "ผู้ปฏิบัติงานด้านการแพทย์แผนไทย Fulltime ชาย";
  var s421f1 = "ผู้ปฏิบัติงานด้านการแพทย์แผนไทย ขรก/พนักงานของรัฐหญิง";
  var s421f5 = "ผู้ปฏิบัติงานด้านการแพทย์แผนไทย Fulltime หญิง";
  var s422m1 = "ผู้ปฏิบัติงานด้านการแพทย์แผนไทย ลูกจ้างชาย";
  var s422m5 = "ผู้ปฏิบัติงานด้านการแพทย์แผนไทย Parttime ชาย";
  var s422f1 = "ผู้ปฏิบัติงานด้านการแพทย์แผนไทย ลูกจ้างหญิง";
  var s422f5 = "ผู้ปฏิบัติงานด้านการแพทย์แผนไทย Parttime หญิง";
}
  var s011m2 = getProf(1,'1','m2');
  var s011m6 = getProf(1,'1','m6');
  var s011f2 = getProf(1,'1','f2');
  var s011f6 = getProf(1,'1','f6');
  var s012m2 = getProf(1,'2','m2');
  var s012m6 = getProf(1,'2','m6');
  var s012f2 = getProf(1,'2','f2');
  var s012f6 = getProf(1,'2','f6');

  var s021m2 = getProf(2,'1','m2');
  var s021m6 = getProf(2,'1','m6');
  var s021f2 = getProf(2,'1','f2');
  var s021f6 = getProf(2,'1','f6');
  var s022m2 = getProf(2,'2','m2');
  var s022m6 = getProf(2,'2','m6');
  var s022f2 = getProf(2,'2','f2');
  var s022f6 = getProf(2,'2','f6');

  var s031m2 = getProf(3,'1','m2');
  var s031m6 = getProf(3,'1','m6');
  var s031f2 = getProf(3,'1','f2');
  var s031f6 = getProf(3,'1','f6');
  var s032m2 = getProf(3,'2','m2');
  var s032m6 = getProf(3,'2','m6');
  var s032f2 = getProf(3,'2','f2');
  var s032f6 = getProf(3,'2','f6');

  var s041m2 = getProf(4,'1','m2');
  var s041m6 = getProf(4,'1','m6');
  var s041f2 = getProf(4,'1','f2');
  var s041f6 = getProf(4,'1','f6');
  var s042m2 = getProf(4,'2','m2');
  var s042m6 = getProf(4,'2','m6');
  var s042f2 = getProf(4,'2','f2');
  var s042f6 = getProf(4,'2','f6');

  var s051m2 = getProf(5,'1','m2');
  var s051m6 = getProf(5,'1','m6');
  var s051f2 = getProf(5,'1','f2');
  var s051f6 = getProf(5,'1','f6');
  var s052m2 = getProf(5,'2','m2');
  var s052m6 = getProf(5,'2','m6');
  var s052f2 = getProf(5,'2','f2');
  var s052f6 = getProf(5,'2','f6');

  var s061m2 = getProf(6,'1','m2');
  var s061m6 = getProf(6,'1','m6');
  var s061f2 = getProf(6,'1','f2');
  var s061f6 = getProf(6,'1','f6');
  var s062m2 = getProf(6,'2','m2');
  var s062m6 = getProf(6,'2','m6');
  var s062f2 = getProf(6,'2','f2');
  var s062f6 = getProf(6,'2','f6');

  var s071m2 = getProf(7,'1','m2');
  var s071m6 = getProf(7,'1','m6');
  var s071f2 = getProf(7,'1','f2');
  var s071f6 = getProf(7,'1','f6');
  var s072m2 = getProf(7,'2','m2');
  var s072m6 = getProf(7,'2','m6');
  var s072f2 = getProf(7,'2','f2');
  var s072f6 = getProf(7,'2','f6');

  var s081m2 = getProf(8,'1','m2');
  var s081m6 = getProf(8,'1','m6');
  var s081f2 = getProf(8,'1','f2');
  var s081f6 = getProf(8,'1','f6');
  var s082m2 = getProf(8,'2','m2');
  var s082m6 = getProf(8,'2','m6');
  var s082f2 = getProf(8,'2','f2');
  var s082f6 = getProf(8,'2','f6');

  var s091m2 = getProf(9,'1','m2');
  var s091m6 = getProf(9,'1','m6');
  var s091f2 = getProf(9,'1','f2');
  var s091f6 = getProf(9,'1','f6');
  var s092m2 = getProf(9,'2','m2');
  var s092m6 = getProf(9,'2','m6');
  var s092f2 = getProf(9,'2','f2');
  var s092f6 = getProf(9,'2','f6');

  var s101m2 = getProf(1,'1','m2');
  var s101m6 = getProf(1,'1','m6');
  var s101f2 = getProf(1,'1','f2');
  var s101f6 = getProf(1,'1','f6');
  var s102m2 = getProf(1,'2','m2');
  var s102m6 = getProf(1,'2','m6');
  var s102f2 = getProf(1,'2','f2');
  var s102f6 = getProf(1,'2','f6');

  var s111m2 = getProf(11,'1','m2');
  var s111m6 = getProf(11,'1','m6');
  var s111f2 = getProf(11,'1','f2');
  var s111f6 = getProf(11,'1','f6');
  var s112m2 = getProf(11,'2','m2');
  var s112m6 = getProf(11,'2','m6');
  var s112f2 = getProf(11,'2','f2');
  var s112f6 = getProf(11,'2','f6');

  var s121m2 = getProf(12,'1','m2');
  var s121m6 = getProf(12,'1','m6');
  var s121f2 = getProf(12,'1','f2');
  var s121f6 = getProf(12,'1','f6');
  var s122m2 = getProf(12,'2','m2');
  var s122m6 = getProf(12,'2','m6');
  var s122f2 = getProf(12,'2','f2');
  var s122f6 = getProf(12,'2','f6');

  var s131m2 = getProf(13,'1','m2');
  var s131m6 = getProf(13,'1','m6');
  var s131f2 = getProf(13,'1','f2');
  var s131f6 = getProf(13,'1','f6');
  var s132m2 = getProf(13,'2','m2');
  var s132m6 = getProf(13,'2','m6');
  var s132f2 = getProf(13,'2','f2');
  var s132f6 = getProf(13,'2','f6');

  var s141m2 = getProf(14,'1','m2');
  var s141m6 = getProf(14,'1','m6');
  var s141f2 = getProf(14,'1','f2');
  var s141f6 = getProf(14,'1','f6');
  var s142m2 = getProf(14,'2','m2');
  var s142m6 = getProf(14,'2','m6');
  var s142f2 = getProf(14,'2','f2');
  var s142f6 = getProf(14,'2','f6');

  var s151m2 = getProf(15,'1','m2');
  var s151m6 = getProf(15,'1','m6');
  var s151f2 = getProf(15,'1','f2');
  var s151f6 = getProf(15,'1','f6');
  var s152m2 = getProf(15,'2','m2');
  var s152m6 = getProf(15,'2','m6');
  var s152f2 = getProf(15,'2','f2');
  var s152f6 = getProf(15,'2','f6');

  var s161m2 = getProf(16,'1','m2');
  var s161m6 = getProf(16,'1','m6');
  var s161f2 = getProf(16,'1','f2');
  var s161f6 = getProf(16,'1','f6');
  var s162m2 = getProf(16,'2','m2');
  var s162m6 = getProf(16,'2','m6');
  var s162f2 = getProf(16,'2','f2');
  var s162f6 = getProf(16,'2','f6');

  var s171m2 = getProf(17,'1','m2');
  var s171m6 = getProf(17,'1','m6');
  var s171f2 = getProf(17,'1','f2');
  var s171f6 = getProf(17,'1','f6');
  var s172m2 = getProf(17,'2','m2');
  var s172m6 = getProf(17,'2','m6');
  var s172f2 = getProf(17,'2','f2');
  var s172f6 = getProf(17,'2','f6');

  var s181m2 = getProf(18,'1','m2');
  var s181m6 = getProf(18,'1','m6');
  var s181f2 = getProf(18,'1','f2');
  var s181f6 = getProf(18,'1','f6');
  var s182m2 = getProf(18,'2','m2');
  var s182m6 = getProf(18,'2','m6');
  var s182f2 = getProf(18,'2','f2');
  var s182f6 = getProf(18,'2','f6');

  var s191m2 = getProf(19,'1','m2');
  var s191m6 = getProf(19,'1','m6');
  var s191f2 = getProf(19,'1','f2');
  var s191f6 = getProf(19,'1','f6');
  var s192m2 = getProf(19,'2','m2');
  var s192m6 = getProf(19,'2','m6');
  var s192f2 = getProf(19,'2','f2');
  var s192f6 = getProf(19,'2','f6');

  var s201m2 = getProf(20,'1','m2');
  var s201m6 = getProf(20,'1','m6');
  var s201f2 = getProf(20,'1','f2');
  var s201f6 = getProf(20,'1','f6');
  var s202m2 = getProf(20,'2','m2');
  var s202m6 = getProf(20,'2','m6');
  var s202f2 = getProf(20,'2','f2');
  var s202f6 = getProf(20,'2','f6');

  var s211m2 = getProf(21,'1','m2');
  var s211m6 = getProf(21,'1','m6');
  var s211f2 = getProf(21,'1','f2');
  var s211f6 = getProf(21,'1','f6');
  var s212m2 = getProf(21,'2','m2');
  var s212m6 = getProf(21,'2','m6');
  var s212f2 = getProf(21,'2','f2');
  var s212f6 = getProf(21,'2','f6');

  var s221m2 = getProf(22,'1','m2');
  var s221m6 = getProf(22,'1','m6');
  var s221f2 = getProf(22,'1','f2');
  var s221f6 = getProf(22,'1','f6');
  var s222m2 = getProf(22,'2','m2');
  var s222m6 = getProf(22,'2','m6');
  var s222f2 = getProf(22,'2','f2');
  var s222f6 = getProf(22,'2','f6');

  var s231m2 = getProf(23,'1','m2');
  var s231m6 = getProf(23,'1','m6');
  var s231f2 = getProf(23,'1','f2');
  var s231f6 = getProf(23,'1','f6');
  var s232m2 = getProf(23,'2','m2');
  var s232m6 = getProf(23,'2','m6');
  var s232f2 = getProf(23,'2','f2');
  var s232f6 = getProf(23,'2','f6');

  var s241m2 = getProf(24,'1','m2');
  var s241m6 = getProf(24,'1','m6');
  var s241f2 = getProf(24,'1','f2');
  var s241f6 = getProf(24,'1','f6');
  var s242m2 = getProf(24,'2','m2');
  var s242m6 = getProf(24,'2','m6');
  var s242f2 = getProf(24,'2','f2');
  var s242f6 = getProf(24,'2','f6');

  var s251m2 = getProf(25,'1','m2');
  var s251m6 = getProf(25,'1','m6');
  var s251f2 = getProf(25,'1','f2');
  var s251f6 = getProf(25,'1','f6');
  var s252m2 = getProf(25,'2','m2');
  var s252m6 = getProf(25,'2','m6');
  var s252f2 = getProf(25,'2','f2');
  var s252f6 = getProf(25,'2','f6');

  var s261m2 = getProf(26,'1','m2');
  var s261m6 = getProf(26,'1','m6');
  var s261f2 = getProf(26,'1','f2');
  var s261f6 = getProf(26,'1','f6');
  var s262m2 = getProf(26,'2','m2');
  var s262m6 = getProf(26,'2','m6');
  var s262f2 = getProf(26,'2','f2');
  var s262f6 = getProf(26,'2','f6');

  var s271m2 = getProf(27,'1','m2');
  var s271m6 = getProf(27,'1','m6');
  var s271f2 = getProf(27,'1','f2');
  var s271f6 = getProf(27,'1','f6');
  var s272m2 = getProf(27,'2','m2');
  var s272m6 = getProf(27,'2','m6');
  var s272f2 = getProf(27,'2','f2');
  var s272f6 = getProf(27,'2','f6');

  var s281m2 = getProf(28,'1','m2');
  var s281m6 = getProf(28,'1','m6');
  var s281f2 = getProf(28,'1','f2');
  var s281f6 = getProf(28,'1','f6');
  var s282m2 = getProf(28,'2','m2');
  var s282m6 = getProf(28,'2','m6');
  var s282f2 = getProf(28,'2','f2');
  var s282f6 = getProf(28,'2','f6');

  var s291m2 = getProf(29,'1','m2');
  var s291m6 = getProf(29,'1','m6');
  var s291f2 = getProf(29,'1','f2');
  var s291f6 = getProf(29,'1','f6');
  var s292m2 = getProf(29,'2','m2');
  var s292m6 = getProf(29,'2','m6');
  var s292f2 = getProf(29,'2','f2');
  var s292f6 = getProf(29,'2','f6');

  var s301m2 = getProf(30,'1','m2');
  var s301m6 = getProf(30,'1','m6');
  var s301f2 = getProf(30,'1','f2');
  var s301f6 = getProf(30,'1','f6');
  var s302m2 = getProf(30,'2','m2');
  var s302m6 = getProf(30,'2','m6');
  var s302f2 = getProf(30,'2','f2');
  var s302f6 = getProf(30,'2','f6');

  var s311m2 = getProf(31,'1','m2');
  var s311m6 = getProf(31,'1','m6');
  var s311f2 = getProf(31,'1','f2');
  var s311f6 = getProf(31,'1','f6');
  var s312m2 = getProf(31,'2','m2');
  var s312m6 = getProf(31,'2','m6');
  var s312f2 = getProf(31,'2','f2');
  var s312f6 = getProf(31,'2','f6');

  var s321m2 = getProf(32,'1','m2');
  var s321m6 = getProf(32,'1','m6');
  var s321f2 = getProf(32,'1','f2');
  var s321f6 = getProf(32,'1','f6');
  var s322m2 = getProf(32,'2','m2');
  var s322m6 = getProf(32,'2','m6');
  var s322f2 = getProf(32,'2','f2');
  var s322f6 = getProf(32,'2','f6');

  var s331m2 = getProf(33,'1','m2');
  var s331m6 = getProf(33,'1','m6');
  var s331f2 = getProf(33,'1','f2');
  var s331f6 = getProf(33,'1','f6');
  var s332m2 = getProf(33,'2','m2');
  var s332m6 = getProf(33,'2','m6');
  var s332f2 = getProf(33,'2','f2');
  var s332f6 = getProf(33,'2','f6');

  var s341m2 = getProf(34,'1','m2');
  var s341m6 = getProf(34,'1','m6');
  var s341f2 = getProf(34,'1','f2');
  var s341f6 = getProf(34,'1','f6');
  var s342m2 = getProf(34,'2','m2');
  var s342m6 = getProf(34,'2','m6');
  var s342f2 = getProf(34,'2','f2');
  var s342f6 = getProf(34,'2','f6');

  var s351m2 = getProf(35,'1','m2');
  var s351m6 = getProf(35,'1','m6');
  var s351f2 = getProf(35,'1','f2');
  var s351f6 = getProf(35,'1','f6');
  var s352m2 = getProf(35,'2','m2');
  var s352m6 = getProf(35,'2','m6');
  var s352f2 = getProf(35,'2','f2');
  var s352f6 = getProf(35,'2','f6');

  var s361m2 = getProf(36,'1','m2');
  var s361m6 = getProf(36,'1','m6');
  var s361f2 = getProf(36,'1','f2');
  var s361f6 = getProf(36,'1','f6');
  var s362m2 = getProf(36,'2','m2');
  var s362m6 = getProf(36,'2','m6');
  var s362f2 = getProf(36,'2','f2');
  var s362f6 = getProf(36,'2','f6');

  var s371m2 = getProf(37,'1','m2');
  var s371m6 = getProf(37,'1','m6');
  var s371f2 = getProf(37,'1','f2');
  var s371f6 = getProf(37,'1','f6');
  var s372m2 = getProf(37,'2','m2');
  var s372m6 = getProf(37,'2','m6');
  var s372f2 = getProf(37,'2','f2');
  var s372f6 = getProf(37,'2','f6');

  var s381m2 = getProf(38,'1','m2');
  var s381m6 = getProf(38,'1','m6');
  var s381f2 = getProf(38,'1','f2');
  var s381f6 = getProf(38,'1','f6');
  var s382m2 = getProf(38,'2','m2');
  var s382m6 = getProf(38,'2','m6');
  var s382f2 = getProf(38,'2','f2');
  var s382f6 = getProf(38,'2','f6');

  var s391m2 = getProf(39,'1','m2');
  var s391m6 = getProf(39,'1','m6');
  var s391f2 = getProf(39,'1','f2');
  var s391f6 = getProf(39,'1','f6');
  var s392m2 = getProf(39,'2','m2');
  var s392m6 = getProf(39,'2','m6');
  var s392f2 = getProf(39,'2','f2');
  var s392f6 = getProf(39,'2','f6');

  var s401m2 = getProf(40,'1','m2');
  var s401m6 = getProf(40,'1','m6');
  var s401f2 = getProf(40,'1','f2');
  var s401f6 = getProf(40,'1','f6');
  var s402m2 = getProf(40,'2','m2');
  var s402m6 = getProf(40,'2','m6');
  var s402f2 = getProf(40,'2','f2');
  var s402f6 = getProf(40,'2','f6');

  var s411m2 = getProf(41,'1','m2');
  var s411m6 = getProf(41,'1','m6');
  var s411f2 = getProf(41,'1','f2');
  var s411f6 = getProf(41,'1','f6');
  var s412m2 = getProf(41,'2','m2');
  var s412m6 = getProf(41,'2','m6');
  var s412f2 = getProf(41,'2','f2');
  var s412f6 = getProf(41,'2','f6');

  var s421m2 = getProf(42,'1','m2');
  var s421m6 = getProf(42,'1','m6');
  var s421f2 = getProf(42,'1','f2');
  var s421f6 = getProf(42,'1','f6');
  var s422m2 = getProf(42,'2','m2');
  var s422m6 = getProf(42,'2','m6');
  var s422f2 = getProf(42,'2','f2');
  var s422f6 = getProf(42,'2','f6');

  var s431m2 = getProf(43,'1','m2');
  var s431m6 = getProf(43,'1','m6');
  var s431f2 = getProf(43,'1','f2');
  var s431f6 = getProf(43,'1','f6');
  var s432m2 = getProf(43,'2','m2');
  var s432m6 = getProf(43,'2','m6');
  var s432f2 = getProf(43,'2','f2');
  var s432f6 = getProf(43,'2','f6');

  var s441m2 = getProf(44,'1','m2');
  var s441m6 = getProf(44,'1','m6');
  var s441f2 = getProf(44,'1','f2');
  var s441f6 = getProf(44,'1','f6');
  var s442m2 = getProf(44,'2','m2');
  var s442m6 = getProf(44,'2','m6');
  var s442f2 = getProf(44,'2','f2');
  var s442f6 = getProf(44,'2','f6');

  var s451m2 = getProf(45,'1','m2');
  var s451m6 = getProf(45,'1','m6');
  var s451f2 = getProf(45,'1','f2');
  var s451f6 = getProf(45,'1','f6');
  var s452m2 = getProf(45,'2','m2');
  var s452m6 = getProf(45,'2','m6');
  var s452f2 = getProf(45,'2','f2');
  var s452f6 = getProf(45,'2','f6');

  var s461m2 = getProf(46,'1','m2');
  var s461m6 = getProf(46,'1','m6');
  var s461f2 = getProf(46,'1','f2');
  var s461f6 = getProf(46,'1','f6');
  var s462m2 = getProf(46,'2','m2');
  var s462m6 = getProf(46,'2','m6');
  var s462f2 = getProf(46,'2','f2');
  var s462f6 = getProf(46,'2','f6');

  var s471m2 = getProf(47,'1','m2');
  var s471m6 = getProf(47,'1','m6');
  var s471f2 = getProf(47,'1','f2');
  var s471f6 = getProf(47,'1','f6');
  var s472m2 = getProf(47,'2','m2');
  var s472m6 = getProf(47,'2','m6');
  var s472f2 = getProf(47,'2','f2');
  var s472f6 = getProf(47,'2','f6');

  var s481m2 = getProf(48,'1','m2');
  var s481m6 = getProf(48,'1','m6');
  var s481f2 = getProf(48,'1','f2');
  var s481f6 = getProf(48,'1','f6');
  var s482m2 = getProf(48,'2','m2');
  var s482m6 = getProf(48,'2','m6');
  var s482f2 = getProf(48,'2','f2');
  var s482f6 = getProf(48,'2','f6');

  var s491m2 = getProf(49,'1','m2');
  var s491m6 = getProf(49,'1','m6');
  var s491f2 = getProf(49,'1','f2');
  var s491f6 = getProf(49,'1','f6');
  var s492m2 = getProf(49,'2','m2');
  var s492m6 = getProf(49,'2','m6');
  var s492f2 = getProf(49,'2','f2');
  var s492f6 = getProf(49,'2','f6');

  var s501m2 = getProf(50,'1','m2');
  var s501m6 = getProf(50,'1','m6');
  var s501f2 = getProf(50,'1','f2');
  var s501f6 = getProf(50,'1','f6');
  var s502m2 = getProf(50,'2','m2');
  var s502m6 = getProf(50,'2','m6');
  var s502f2 = getProf(50,'2','f2');
  var s502f6 = getProf(50,'2','f6');

  var s511m2 = getProf(51,'1','m2');
  var s511m6 = getProf(51,'1','m6');
  var s511f2  = getProf(51,'1','f2');
  var s511f6  = getProf(51,'1','f6');
  var s512m2 = getProf(51,'2','m2');
  var s512m6 = getProf(51,'2','m6');
  var s512f2  = getProf(51,'2','f2');
  var s512f6  = getProf(51,'2','f6');

  var s521m2 = getProf(52,'1','m2');
  var s521m6 = getProf(52,'1','m6');
  var s521f2  = getProf(52,'1','f2');
  var s521f6  = getProf(52,'1','f6');
  var s522m2 = getProf(52,'2','m2');
  var s522m6 = getProf(52,'2','m6');
  var s522f2  = getProf(52,'2','f2');
  var s522f6  = getProf(52,'2','f6');

  var s531m2 = getProf(53,'1','m2');
  var s531m6 = getProf(53,'1','m6');
  var s531f2  = getProf(53,'1','f2');
  var s531f6  = getProf(53,'1','f6');
  var s532m2 = getProf(53,'2','m2');
  var s532m6 = getProf(53,'2','m6');
  var s532f2  = getProf(53,'2','f2');
  var s532f6  = getProf(53,'2','f6');

  var s541m2 = getProf(54,'1','m2');
  var s541m6 = getProf(54,'1','m6');
  var s541f2  = getProf(54,'1','f2');
  var s541f6  = getProf(54,'1','f6');
  var s542m2 = getProf(54,'2','m2');
  var s542m6 = getProf(54,'2','m6');
  var s542f2  = getProf(54,'2','f2');
  var s542f6  = getProf(54,'2','f6');

  var s551m2 = getProf(55,'1','m2');
  var s551m6 = getProf(55,'1','m6');
  var s551f2  = getProf(55,'1','f2');
  var s551f6  = getProf(55,'1','f6');
  var s552m2 = getProf(55,'2','m2');
  var s552m6 = getProf(55,'2','m6');
  var s552f2  = getProf(55,'2','f2');
  var s552f6  = getProf(55,'2','f6');

  var s561m2 = getProf(56,'1','m2');
  var s561m6 = getProf(56,'1','m6');
  var s561f2  = getProf(56,'1','f2');
  var s561f6  = getProf(56,'1','f6');
  var s562m2 = getProf(56,'2','m2');
  var s562m6 = getProf(56,'2','m6');
  var s562f2  = getProf(56,'2','f2');
  var s562f6  = getProf(56,'2','f6');

  var s571m2 = getProf(57,'1','m2');
  var s571m6 = getProf(57,'1','m6');
  var s571f2  = getProf(57,'1','f2');
  var s571f6  = getProf(57,'1','f6');
  var s572m2 = getProf(57,'2','m2');
  var s572m6 = getProf(57,'2','m6');
  var s572f2  = getProf(57,'2','f2');
  var s572f6  = getProf(57,'2','f6');

  var s581m2 = getProf(58,'1','m2');
  var s581m6 = getProf(58,'1','m6');
  var s581f2  = getProf(58,'1','f2');
  var s581f6  = getProf(58,'1','f6');
  var s582m2 = getProf(58,'2','m2');
  var s582m6 = getProf(58,'2','m6');
  var s582f2  = getProf(58,'2','f2');
  var s582f6  = getProf(58,'2','f6');

  var s591m2 = getProf(59,'1','m2');
  var s591m6 = getProf(59,'1','m6');
  var s591f2  = getProf(59,'1','f2');
  var s591f6  = getProf(59,'1','f6');
  var s592m2 = getProf(59,'2','m2');
  var s592m6 = getProf(59,'2','m6');
  var s592f2  = getProf(59,'2','f2');
  var s592f6  = getProf(59,'2','f6');

  var s601m2 = getProf(60,'1','m2');
  var s601m6 = getProf(60,'1','m6');
  var s601f2  = getProf(60,'1','f2');
  var s601f6  = getProf(60,'1','f6');
  var s602m2 = getProf(60,'2','m2');
  var s602m6 = getProf(60,'2','m6');
  var s602f2  = getProf(60,'2','f2');
  var s602f6  = getProf(60,'2','f6');

  var s611m2 = getProf(61,'1','m2');
  var s611m6 = getProf(61,'1','m6');
  var s611f2  = getProf(61,'1','f2');
  var s611f6  = getProf(61,'1','f6');
  var s612m2 = getProf(61,'2','m2');
  var s612m6 = getProf(61,'2','m6');
  var s612f2  = getProf(61,'2','f2');
  var s612f6  = getProf(61,'2','f6');

  var s621m2 = getProf(62,'1','m2');
  var s621m6 = getProf(62,'1','m6');
  var s621f2  = getProf(62,'1','f2');
  var s621f6  = getProf(62,'1','f6');
  var s622m2 = getProf(62,'2','m2');
  var s622m6 = getProf(62,'2','m6');
  var s622f2  = getProf(62,'2','f2');
  var s622f6  = getProf(62,'2','f6');

  var s631m2 = getProf(63,'1','m2');
  var s631m6 = getProf(63,'1','m6');
  var s631f2  = getProf(63,'1','f2');
  var s631f6  = getProf(63,'1','f6');
  var s632m2 = getProf(63,'2','m2');
  var s632m6 = getProf(63,'2','m6');
  var s632f2  = getProf(63,'2','f2');
  var s632f6  = getProf(63,'2','f6');

  var s641m2 = getProf(64,'1','m2');
  var s641m6 = getProf(64,'1','m6');
  var s641f2  = getProf(64,'1','f2');
  var s641f6  = getProf(64,'1','f6');
  var s642m2 = getProf(64,'2','m2');
  var s642m6 = getProf(64,'2','m6');
  var s642f2  = getProf(64,'2','f2');
  var s642f6  = getProf(64,'2','f6');

  var s651m2 = getProf(65,'1','m2');
  var s651m6 = getProf(65,'1','m6');
  var s651f2  = getProf(65,'1','f2');
  var s651f6  = getProf(65,'1','f6');
  var s652m2 = getProf(65,'2','m2');
  var s652m6 = getProf(65,'2','m6');
  var s652f2  = getProf(65,'2','f2');
  var s652f6  = getProf(65,'2','f6');

  var s661m2 = getProf(66,'1','m2');
  var s661m6 = getProf(66,'1','m6');
  var s661f2  = getProf(66,'1','f2');
  var s661f6  = getProf(66,'1','f6');
  var s662m2 = getProf(66,'2','m2');
  var s662m6 = getProf(66,'2','m6');
  var s662f2  = getProf(66,'2','f2');
  var s662f6  = getProf(66,'2','f6');

  var s671m2 = getProf(67,'1','m2');
  var s671m6 = getProf(67,'1','m6');
  var s671f2  = getProf(67,'1','f2');
  var s671f6  = getProf(67,'1','f6');
  var s672m2 = getProf(67,'2','m2');
  var s672m6 = getProf(67,'2','m6');
  var s672f2  = getProf(67,'2','f2');
  var s672f6  = getProf(67,'2','f6');

  var s681m2 = getProf(68,'1','m2');
  var s681m6 = getProf(68,'1','m6');
  var s681f2  = getProf(68,'1','f2');
  var s681f6  = getProf(68,'1','f6');
  var s682m2 = getProf(68,'2','m2');
  var s682m6 = getProf(68,'2','m6');
  var s682f2  = getProf(68,'2','f2');
  var s682f6  = getProf(68,'2','f6');

  var s691m2 = getProf(69,'1','m2');
  var s691m6 = getProf(69,'1','m6');
  var s691f2  = getProf(69,'1','f2');
  var s691f6  = getProf(69,'1','f6');
  var s692m2 = getProf(69,'2','m2');
  var s692m6 = getProf(69,'2','m6');
  var s692f2  = getProf(69,'2','f2');
  var s692f6  = getProf(69,'2','f6');

  var s701m2 = getProf(70,'1','m2');
  var s701m6 = getProf(70,'1','m6');
  var s701f2  = getProf(70,'1','f2');
  var s701f6  = getProf(70,'1','f6');
  var s702m2 = getProf(70,'2','m2');
  var s702m6 = getProf(70,'2','m6');
  var s702f2  = getProf(70,'2','f2');
  var s702f6  = getProf(70,'2','f6');

  var s711m2 = getProf(71,'1','m2');
  var s711m6 = getProf(71,'1','m6');
  var s711f2  = getProf(71,'1','f2');
  var s711f6  = getProf(71,'1','f6');
  var s712m2 = getProf(71,'2','m2');
  var s712m6 = getProf(71,'2','m6');
  var s712f2  = getProf(71,'2','f2');
  var s712f6  = getProf(71,'2','f6');

  var s721m2 = getProf(72,'1','m2');
  var s721m6 = getProf(72,'1','m6');
  var s721f2  = getProf(72,'1','f2');
  var s721f6  = getProf(72,'1','f6');
  var s722m2 = getProf(72,'2','m2');
  var s722m6 = getProf(72,'2','m6');
  var s722f2  = getProf(72,'2','f2');
  var s722f6  = getProf(72,'2','f6');

  var s731m2 = getProf(73,'1','m2');
  var s731m6 = getProf(73,'1','m6');
  var s731f2  = getProf(73,'1','f2');
  var s731f6  = getProf(73,'1','f6');
  var s732m2 = getProf(73,'2','m2');
  var s732m6 = getProf(73,'2','m6');
  var s732f2  = getProf(73,'2','f2');
  var s732f6  = getProf(73,'2','f6');

  var s741m2 = getProf(74,'1','m2');
  var s741m6 = getProf(74,'1','m6');
  var s741f2  = getProf(74,'1','f2');
  var s741f6  = getProf(74,'1','f6');
  var s742m2 = getProf(74,'2','m2');
  var s742m6 = getProf(74,'2','m6');
  var s742f2  = getProf(74,'2','f2');
  var s742f6  = getProf(74,'2','f6');

  var s751m2 = getProf(75,'1','m2');
  var s751m6 = getProf(75,'1','m6');
  var s751f2  = getProf(75,'1','f2');
  var s751f6  = getProf(75,'1','f6');
  var s752m2 = getProf(75,'2','m2');
  var s752m6 = getProf(75,'2','m6');
  var s752f2  = getProf(75,'2','f2');
  var s752f6  = getProf(75,'2','f6');

  var s761m2 = getProf(76,'1','m2');
  var s761m6 = getProf(76,'1','m6');
  var s761f2  = getProf(76,'1','f2');
  var s761f6  = getProf(76,'1','f6');
  var s762m2 = getProf(76,'2','m2');
  var s762m6 = getProf(76,'2','m6');
  var s762f2  = getProf(76,'2','f2');
  var s762f6  = getProf(76,'2','f6');

  var s771m2 = getProf(77,'1','m2');
  var s771m6 = getProf(77,'1','m6');
  var s771f2  = getProf(77,'1','f2');
  var s771f6  = getProf(77,'1','f6');
  var s772m2 = getProf(77,'2','m2');
  var s772m6 = getProf(77,'2','m6');
  var s772f2  = getProf(77,'2','f2');
  var s772f6  = getProf(77,'2','f6');

  var s781m2 = getProf(78,'1','m2');
  var s781m6 = getProf(78,'1','m6');
  var s781f2  = getProf(78,'1','f2');
  var s781f6  = getProf(78,'1','f6');
  var s782m2 = getProf(78,'2','m2');
  var s782m6 = getProf(78,'2','m6');
  var s782f2  = getProf(78,'2','f2');
  var s782f6  = getProf(78,'2','f6');

  var s791m2 = getProf(79,'1','m2');
  var s791m6 = getProf(79,'1','m6');
  var s791f2  = getProf(79,'1','f2');
  var s791f6  = getProf(79,'1','f6');
  var s792m2 = getProf(79,'2','m2');
  var s792m6 = getProf(79,'2','m6');
  var s792f2  = getProf(79,'2','f2');
  var s792f6  = getProf(79,'2','f6');

  var s201 = "2.1 จำนวนเตียงผู้ป่วย";
  var s202 = "2.2 จำนวนเตียงผู้ป่วยหนัก(I.C.U.) ศัลยกรรม";
  var s203 = "2.3 จำนวนเตียงผู้ป่วยหนัก(I.C.U.) อายุรกรรม";
  var s204 = "2.4 จำนวนเตียงผู้ป่วยหนัก(I.C.U.) กุมารเวชกรรม";
  var s205 = "2.5 จำนวนเตียงผู้ป่วยหนัก(I.C.U.) สูติ-นารีเวชกรรม";
  var s206 = "2.6 จำนวนเตียงผู้ป่วยหนัก(I.C.U.) รวม";
  var s207 = "2.7 จำนวนผู้ป่วยนอกใหม่ที่มารับบริการครั้งแรกของปี";
  var s208 = "2.8 จำนวนผู้ป่วยนอกทั้งหมดที่มารับบริการ";
  var s209 = "2.9 จำนวนผู้รับบริการอื่น ๆ ที่มารับบริการครั้งแรก";
  var s210 = "2.10 จำนวนผู้รับบริการอื่น ๆ ที่มารับบริการทั้งหมด";
  var s211 = "2.11 จำนวนผู้ป่วยใน";
  var s212 = "2.12 จำนวนวันอยู่ในโรงพยาบาล(Patient day)ของผู้ป่วยในทั้งหมด";

</script>
<input type='button' value='กลับหน้าที่แล้ว' onclick='history.back()' />
<pre>
#{h}
</pre>
<input type='button' value='กลับหน้าที่แล้ว' onclick='history.back()' />
EOF
